Функция ПолучитьСуммуТарифаНаДату(Тариф, Дата) Экспорт
	
	С = новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныТарифовСрезПоследних.Сумма КАК Сумма,
		|	ЦеныТарифовСрезПоследних.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.LM_ЦеныТарифов.СрезПоследних(&Период, Тариф = &Тариф) КАК ЦеныТарифовСрезПоследних";  	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		С.Вставить("Сумма",РезультатЗапроса[0].Сумма);
		С.Вставить("КоличествоЧасов",РезультатЗапроса[0].КоличествоЧасов);
		Возврат С;
	Иначе
		Возврат 0;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
