Функция ПолучитьСуммуТарифаНаДату(Тариф, Дата) Экспорт
	
	С = новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныТарифовСрезПоследних.Сумма КАК Сумма,
		|	ЦеныТарифовСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
		|	ЦеныТарифовСрезПоследних.ЗаЗанятие КАК ЗаЗанятие
		|ИЗ
		|	РегистрСведений.LM_ЦеныТарифов.СрезПоследних(&Период, Тариф = &Тариф) КАК ЦеныТарифовСрезПоследних";  	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		
		Если РезультатЗапроса[0].ЗаЗанятие Тогда
			С.Вставить("Сумма",РезультатЗапроса[0].Сумма);
			С.Вставить("КоличествоЧасов",0);
		Иначе			
			С.Вставить("Сумма",РезультатЗапроса[0].Сумма);
			С.Вставить("КоличествоЧасов",РезультатЗапроса[0].КоличествоЧасов);
		КонецЕсли;
		
		Возврат С;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
