
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Если Замещение Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	СписанияСуммЗаУроки.Регистратор КАК Регистратор
	//	|ИЗ
	//	|	РегистрНакопления.LM_СписанияСуммЗаУроки КАК СписанияСуммЗаУроки
	//	|ГДЕ
	//	|	СписанияСуммЗаУроки.Тариф = &Тариф
	//	//|	И СписанияСуммЗаУроки.Организация = &Организация
	//	|	И СписанияСуммЗаУроки.Период >= &Период";
	//	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.Период.Значение);
	//	Запрос.УстановитьПараметр("Тариф", ЭтотОбъект.Отбор.Тариф.Значение);
	//	//Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Отбор.Организация.Значение);
	//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//	
	//	Если РезультатЗапроса.Количество() = 1 Тогда
	//		Сообщить("Изменение не выполнено! Существуют проведенные документы по тарифу: " +ЭтотОбъект.Отбор.Тариф.Значение + " на " +Формат(ЭтотОбъект.Отбор.Период.Значение,"ДЛФ=DD")
	//		+Символы.ПС+"Распроведите связанные документы перед изменением!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры
