
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Замещение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СписанияСуммЗаУроки.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки КАК СписанияСуммЗаУроки
		|ГДЕ
		|	СписанияСуммЗаУроки.Тариф = &Тариф";
		Запрос.УстановитьПараметр("Тариф", ЭтотОбъект.Отбор.Тариф.Значение);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() = 1 Тогда
			Сообщить("Изменение не выполнено! Существуют проведенные документы по тарифу: " +ЭтотОбъект.Отбор.Тариф.Значение
			+Символы.ПС+"Распроведите связанные документы перед изменением!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
