
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//дата запрета проверяется подпиской УЗ_ДатаЗапретаПередЗаписью (модуль УЗ_ДатыЗапрета)
	
	// регистр Касса	
	Если ЗначениеЗаполнено(СуммаДокумента) Тогда
		Движения.УЗ_Касса.Записывать = Истина;
		Движение = Движения.УЗ_Касса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 		= Дата;
		Движение.Клиент 	 		= ФизЛицо;
		Движение.Сумма  	 		= СуммаДокумента;
		Движение.Касса 		 		= Касса;
		Движение.ПредметОбучения 	= ПредметОбучения;
		Движение.ВидОперации 		= ВидОперации;
		Движение.СтатьяЗатрат 		= СтатьяЗатрат;
		Движение.Организация 		= Организация;
		Движение.Абонемент 			= Абонемент;
	КонецЕсли; 
	
	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики и ЗначениеЗаполнено(СуммаДокумента) Тогда
		// регистр СписанияСуммЗаУроки 
		Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
		Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 		= Дата;
		Движение.Клиент 	 		= ФизЛицо;
		Движение.Сумма  	 		= СуммаДокумента;
		Движение.Тариф		 		= Тариф;
		Движение.ПредметОбучения 	= ПредметОбучения;
		Движение.Организация 		= Организация;
		Движение.Абонемент 			= Абонемент;
	КонецЕсли; 	          	
	
	Если ЗначениеЗаполнено(ДисконтнаяКарта) и ЗначениеЗаполнено(СуммаБонусов) Тогда
		
		Если ЗначениеЗаполнено(ДисконтнаяКарта.ДатаОкончанияДействия) и НачалоДня(ДисконтнаяКарта.ДатаОкончанияДействия) <= НачалоДня(Дата) Тогда
			Отказ = Истина;
			Сообщить("У дисконтной карты: " +ДисконтнаяКарта+ " истек срок действия!");
		КонецЕсли;
		
		ОстатокДоступныхБонусовИДенегПоКарте = ОпределитьОстатокДоступныхБонусовИДенег();
		Если ОстатокДоступныхБонусовИДенегПоКарте <> Неопределено Тогда
			
			Если СуммаБонусов > ОстатокДоступныхБонусовИДенегПоКарте.СуммаБонусовОстаток Тогда
				Отказ = Истина;
				Сообщить("Недостаточно бонусов для списания! ОстатокДоступныхБонусовПоКарте = " +ОстатокДоступныхБонусовИДенегПоКарте.СуммаБонусовОстаток);
			КонецЕсли;
		КонецЕсли;
		
		//СписаниеБонусов
		Если ЗначениеЗаполнено(СуммаБонусов) Тогда
			Движения.УЗ_ДвижениеДисконтныхКарт.Записывать = Истина;
			Движение = Движения.УЗ_ДвижениеДисконтныхКарт.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 	 		= Дата;
			Движение.Клиент 	 		= ДисконтнаяКарта.Владелец;
			Движение.ДисконтнаяКарта 	= ДисконтнаяКарта;
			Движение.СуммаБонусов		= СуммаБонусов;
			Движение.Организация 		= Организация;
		КонецЕсли;
		
		// регистр СписанияСуммЗаУроки ОплачиваемБонусами
		Если ЗначениеЗаполнено(СуммаБонусов) Тогда
			Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
			Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период 	 		= Дата;
			Движение.Клиент 	 		= ФизЛицо;
			Движение.Сумма  	 		= СуммаБонусов;
			Движение.Тариф		 		= Тариф;
			Движение.ПредметОбучения 	= ПредметОбучения;
			Движение.Организация 		= Организация;
			Движение.Абонемент 			= Абонемент;
		КонецЕсли;

	КонецЕсли;     	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	    	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) Тогда
		ЭтотОбъект.АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЗ_Урок") Тогда
		//ДокументОснования = ДанныеЗаполнения.Ссылка;
		//ВидОперации		  = Перечисления.УЗ_ВидыОпераций.КассаУченики;
		//Организация 	  = ДанныеЗаполнения.Организация;
		//ПредметОбучения	  = ДанныеЗаполнения.ПредметОбучения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") Тогда
		
		ВидОперации	= Перечисления.УЗ_ВидыОпераций.КассаУченики;
		ФизЛицо	= ДанныеЗаполнения.Ссылка;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Ссылка.Родитель1) Тогда
			Родитель = ДанныеЗаполнения.Ссылка.Родитель1;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_Абонемент") Тогда
		
		ВидОперации			= Перечисления.УЗ_ВидыОпераций.КассаУченики;
		ФизЛицо			= ДанныеЗаполнения.Ссылка.ФизЛицо;
		Абонемент			= ДанныеЗаполнения.Ссылка;
		ДокументОснования 	= ДанныеЗаполнения.Ссылка;
		ПредметОбучения 	= ДанныеЗаполнения.Ссылка.ПредметОбучения;
		СуммаДокумента	    = ДанныеЗаполнения.Ссылка.ЦенаАбонемента;
		
	КонецЕсли;	
		
КонецПроцедуры

Функция ОпределитьОстатокДоступныхБонусовИДенег()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток
	|ИЗ
	|	РегистрНакопления.УЗ_ДвижениеДисконтныхКарт.Остатки(, ) КАК ДвижениеДисконтныхКартОстатки
	|ГДЕ
	|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта = &ДисконтнаяКарта";
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ДанныеС = Новый Структура;
		ДанныеС.Вставить("СуммаБонусовОстаток",ВыборкаДетальныеЗаписи.СуммаБонусовОстаток);
		Возврат ДанныеС;		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	АвторДокумента 	= Неопределено;
	Комментарий    	= Неопределено;
	Абонемент 		= Неопределено;
	ДисконтнаяКарта = Неопределено;
	ДокументОснования = Неопределено;
	
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
КонецПроцедуры

