
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РасходыТарифПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РасходыЧасыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента",ДанныеС ,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";	
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры
