
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытьФорму");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасовПриИзменении(Элемент)
	Запись.КоличествоУроков = 0;
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗанятийПриИзменении(Элемент)
	Запись.КоличествоЧасов = 0;
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если Запись.КоличествоУроков > 0 Тогда
		Элементы.Декорация1.Заголовок = "" +Формат(Запись.Сумма/Запись.КоличествоУроков,"ЧДЦ=2")+ " за 1 урок ("
		+Формат(Запись.Сумма,"ЧДЦ=2")+ " / " +Запись.КоличествоУроков+ " ур.)";
	ИначеЕсли Запись.КоличествоЧасов > 0 Тогда
		Элементы.Декорация1.Заголовок = "" +Формат(Запись.Сумма/Запись.КоличествоЧасов,"ЧДЦ=2")+ " за 1 час ("
		+Формат(Запись.Сумма,"ЧДЦ=2")+ " / " +Запись.КоличествоЧасов+ " ч.)";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры
