
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//TODO УЗ: даты запрета
//	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	 Если Объект.ТЗСписания.Количество()>0 Тогда
		Элементы.ГруппаДокумент.Заголовок = "Взаиморасчеты (" +Объект.ТЗСписания.Количество()+")";
	КонецЕсли;
	
	Если Объект.ДисконтныеКарты.Количество()>0 Тогда
		Элементы.ГруппаДокумент1.Заголовок = "Бонусы (" +Объект.ДисконтныеКарты.Количество()+")";
	КонецЕсли;
	
	Если Объект.ТЗСписаниеКасса.Количество()>0 Тогда
		Элементы.ГруппаДокумент2.Заголовок = "Касса (" +Объект.ТЗСписаниеКасса.Количество()+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписанияПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента",ДанныеС ,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";	
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры


