
&НаСервере
Процедура ОбработатьФайлыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фото.Файл КАК Файл,
	|	Фото.Наименование КАК Наименование,
	|	Фото.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УЗ_Фото КАК Фото";
	РезультатЗапроса = Запрос.Выполнить();
	Фотки = РезультатЗапроса.Выбрать();
	Пока Фотки.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Фотки.Файл.Получить()) Тогда
			Продолжить;
		КонецЕсли;
		
		///ДвоичныеДанные = Фотки.Файл.Получить();
		//ДвоичныеДанные.Записать("c:\temp\"+Фотки.Наименование+".jpg");
		Карт = Новый Картинка(Фотки.Файл.Получить());
		
		Попытка
			КартинкаJPG = Карт.Преобразовать(ФорматКартинки.JPEG);
			КартинкаJPG.Записать("c:\temp\"+Фотки.Наименование+".jpg");
		Исключение
			//КартинкаPNG = Карт.Преобразовать(ФорматКартинки.PNG);
			//КартинкаJPG.Записать("c:\temp\"+Фотки.Наименование+".png");
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайлы(Команда)
	
	Состояние("Идет обработка файлов...");
	ОбработатьФайлыНаСервере();
	Состояние("Окончено!");
	
КонецПроцедуры


&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ПутьНачалоВыбораЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Путь = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ЗагрузитьФотографии(Команда)
	
	ЗагрузитьФотографииНаСервере();
	
КонецПроцедуры

Процедура ЗагрузитьФотографииНаСервере()
	
	НайденныеФайлы = НайтиФайлы(ПутьЗагрузки, "*.jpg");
	
	Для Каждого ФайлФото из НайденныеФайлы Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Фото.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УЗ_Фото КАК Фото
		|ГДЕ
		|	Фото.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ФайлФото.ИмяБезРасширения); 		
		РезультатЗапроса = Запрос.Выполнить();   		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Об = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			Попытка
				ЛокХранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлФото.ПолноеИмя));
			Исключение
			КонецПопытки;
			
			Об.Файл = ЛокХранилище;
			
			Попытка
				Об.Записать();
			Исключение
			КонецПопытки;	
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры






&НаКлиенте
Процедура ПутьЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ПутьЗагрузкиНачалоВыбораЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьЗагрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьЗагрузки = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры
