
&НаКлиенте
Процедура ПедагогСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = Новый Структура;
	
	Назв = СокрЛП(Элемент.ТекстРедактирования);
	
	Если Найти(Назв," ") > 0 Тогда
		Симв1 = Найти(Назв," ");
		ПараметрыСтроки.Вставить("Фамилия",Лев(Назв,Симв1-1));
		Назв = СокрЛП(Сред(Назв,Симв1+1));
	Иначе
		ПараметрыСтроки.Вставить("Фамилия",Назв);
		Назв = "";
	КонецЕсли;
	
	Если (Найти(Назв," ") > 0) и (СтрДлина(Назв) > 0) Тогда
		Симв2 = Найти(Назв," ");
		ПараметрыСтроки.Вставить("Имя",Лев(Назв,Симв2-1));
		Назв = СокрЛП(Сред(Назв,Симв2+1));
	Иначе
		ПараметрыСтроки.Вставить("Имя",Назв);
		Назв = "";
	КонецЕсли;
	
	Если СтрДлина(Назв) > 0 Тогда
		ПараметрыСтроки.Вставить("Отчество",Назв);
	КонецЕсли;
	
	ПараметрыСтроки.Вставить("Группа","Педагоги");
	
	Пар = Новый Структура("Ключ2", ПараметрыСтроки);
	
	ОткрытьФорму("Справочник.LM_ФизЛица.Форма.ФормаЭлемента",Пар,ЭтотОбъект,ЭтаФорма.УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПНПриИзменении(Элемент)
	
	ОбновитьДоступностьВремени();
	
	//Если Объект.ПН Тогда
	//	Элементы.ПНВремя.Доступность = Истина;
	//	Объект.ПНВремя = ?(ЗначениеЗаполнено(Объект.ПНВремя),Объект.ПНВремя,Объект.Время);
	//Иначе
	//	Элементы.ПНВремя.Доступность = Ложь;
	//	Объект.ПНВремя = Неопределено;
	//КонецЕсли;	
		
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьДоступностьВремени()
	
	Если Объект.ПН Тогда
		Элементы.ПНВремя.Доступность = Истина;
		Элементы.ПНВремя2.Доступность = Истина;
	Иначе
		Элементы.ПНВремя.Доступность = Ложь;
		Элементы.ПНВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Элементы.ВТВремя.Доступность = Истина;
		Элементы.ВТВремя2.Доступность = Истина;
	Иначе
		Элементы.ВТВремя.Доступность = Ложь;
		Элементы.ВТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Элементы.СРВремя.Доступность = Истина;
		Элементы.СРВремя2.Доступность = Истина;
	Иначе
		Элементы.СРВремя.Доступность = Ложь;
		Элементы.СРВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Элементы.ЧТВремя.Доступность = Истина;
		Элементы.ЧТВремя2.Доступность = Истина;
	Иначе
		Элементы.ЧТВремя.Доступность = Ложь;
		Элементы.ЧТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Элементы.ПТВремя.Доступность = Истина;
		Элементы.ПТВремя2.Доступность = Истина;
	Иначе
		Элементы.ПТВремя.Доступность = Ложь;
		Элементы.ПТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Элементы.СБВремя.Доступность = Истина;
		Элементы.СБВремя2.Доступность = Истина;
	Иначе
		Элементы.СБВремя.Доступность = Ложь;
		Элементы.СБВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Элементы.ВСВремя.Доступность = Истина;
		Элементы.ВСВремя2.Доступность = Истина;
	Иначе
		Элементы.ВСВремя.Доступность = Ложь;
		Элементы.ВСВремя2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры  

//&НаКлиенте
//Процедура ОбновитьВидимость()
//	
//	Если Объект.ПН Тогда
//		Элементы.ПНВремя.Доступность = Истина;
//		Объект.ПНВремя = ?(ЗначениеЗаполнено(Объект.ПНВремя),Объект.ПНВремя,Объект.Время);
//	Иначе
//		Элементы.ПНВремя.Доступность = Ложь;
//		Объект.ПНВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.ВТ Тогда
//		Элементы.ВТВремя.Доступность = Истина;
//		Объект.ВТВремя = ?(ЗначениеЗаполнено(Объект.ВТВремя),Объект.ВТВремя,Объект.Время);
//	Иначе
//		Элементы.ВТВремя.Доступность = Ложь;
//		Объект.ВТВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.СР Тогда
//		Элементы.СРВремя.Доступность = Истина;
//		Объект.СРВремя = ?(ЗначениеЗаполнено(Объект.СРВремя),Объект.СРВремя,Объект.Время);
//	Иначе
//		Элементы.СРВремя.Доступность = Ложь;
//		Объект.СРВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.ЧТ Тогда
//		Элементы.ЧТВремя.Доступность = Истина;
//		Объект.ЧТВремя = ?(ЗначениеЗаполнено(Объект.ЧТВремя),Объект.ЧТВремя,Объект.Время);
//	Иначе
//		Элементы.ЧТВремя.Доступность = Ложь;
//		Объект.ЧТВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.ПТ Тогда
//		Элементы.ПТВремя.Доступность = Истина;
//		Объект.ПТВремя = ?(ЗначениеЗаполнено(Объект.ПТВремя),Объект.ПТВремя,Объект.Время);
//	Иначе
//		Элементы.ПТВремя.Доступность = Ложь;
//		Объект.ПТВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.СБ Тогда
//		Элементы.СБВремя.Доступность = Истина;
//		Объект.СБВремя = ?(ЗначениеЗаполнено(Объект.СБВремя),Объект.СБВремя,Объект.Время);
//	Иначе
//		Элементы.СБВремя.Доступность = Ложь;
//		Объект.СБВремя = Неопределено;
//	КонецЕсли;
//	
//	Если Объект.ВС Тогда
//		Элементы.ВСВремя.Доступность = Истина;
//		Объект.ВСВремя = ?(ЗначениеЗаполнено(Объект.ВСВремя),Объект.ВСВремя,Объект.Время);
//	Иначе
//		Элементы.ВСВремя.Доступность = Ложь;
//		Объект.ВСВремя = Неопределено;
//	КонецЕсли;

//КонецПроцедуры      

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьВремени();
	//ОбновитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОбщееВремя(Команда)
	
	Если Объект.ПН Тогда
		Объект.ПНВремя = Объект.Время;
		Объект.ПНВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Объект.ВТВремя = Объект.Время;
		Объект.ВТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Объект.СРВремя = Объект.Время;
		Объект.СРВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Объект.ЧТВремя = Объект.Время;
		Объект.ЧТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Объект.ПТВремя = Объект.Время;
		Объект.ПТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Объект.СБВремя = Объект.Время;
		Объект.СБВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Объект.ВСВремя = Объект.Время;
		Объект.ВСВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Продолжительность) или НЕ ЗначениеЗаполнено(Объект.Время) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВремяОкончания = Объект.Время - ('00010101'-Объект.Продолжительность);
	
	Если Объект.ПН Тогда
		Объект.ПНВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Объект.ВТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Объект.СРВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Объект.ЧТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Объект.ПТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Объект.СБВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Объект.ВСВремя2 = Объект.ВремяОкончания;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

