
&НаКлиенте
Процедура ПедагогСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = Новый Структура;
	
	Назв = СокрЛП(Элемент.ТекстРедактирования);
	
	Если Найти(Назв," ") > 0 Тогда
		Симв1 = Найти(Назв," ");
		ПараметрыСтроки.Вставить("Наименование",Лев(Назв,Симв1-1));
		Назв = СокрЛП(Сред(Назв,Симв1+1));
	Иначе
		ПараметрыСтроки.Вставить("Наименование",Назв);
		Назв = "";
	КонецЕсли;
	
	ПараметрыСтроки.Вставить("Группа","Педагоги");
	
	Пар = Новый Структура("Ключ2", ПараметрыСтроки);
	
	ОткрытьФорму("Справочник.LM_ФизЛица.Форма.ФормаЭлемента",Пар,ЭтотОбъект,ЭтаФорма.УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПНПриИзменении(Элемент)
	ОбновитьДоступностьВремени();
КонецПроцедуры
Процедура ОбновитьДоступностьВремени()
	
	Если Объект.ПН Тогда
		Элементы.ПНВремя.Доступность = Истина;
		Элементы.ПНВремя2.Доступность = Истина;
		//Объект.ПНВремя = Объект.Время;
		//Объект.ПНВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.ПНВремя = Неопределено;
		Объект.ПНВремя2 = Неопределено;
		Элементы.ПНВремя.Доступность = Ложь;
		Элементы.ПНВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Элементы.ВТВремя.Доступность = Истина;
		Элементы.ВТВремя2.Доступность = Истина;
		//Объект.ВТВремя = Объект.Время;
		//Объект.ВТВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.ВТВремя = Неопределено;
		Объект.ВТВремя2 = Неопределено;
		Элементы.ВТВремя.Доступность = Ложь;
		Элементы.ВТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Элементы.СРВремя.Доступность = Истина;
		Элементы.СРВремя2.Доступность = Истина;
		//Объект.СРВремя = Объект.Время;
		//Объект.СРВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.СРВремя = Неопределено;
		Объект.СРВремя2 = Неопределено;
		Элементы.СРВремя.Доступность = Ложь;
		Элементы.СРВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Элементы.ЧТВремя.Доступность = Истина;
		Элементы.ЧТВремя2.Доступность = Истина;
		//Объект.ЧТВремя = Объект.Время;
		//Объект.ЧТВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.ЧТВремя = Неопределено;
		Объект.ЧТВремя2 = Неопределено;
		Элементы.ЧТВремя.Доступность = Ложь;
		Элементы.ЧТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Элементы.ПТВремя.Доступность = Истина;
		Элементы.ПТВремя2.Доступность = Истина;
		//Объект.ПТВремя = Объект.Время;
		//Объект.ПТВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.ПТВремя = Неопределено;
		Объект.ПТВремя2 = Неопределено;
		Элементы.ПТВремя.Доступность = Ложь;
		Элементы.ПТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Элементы.СБВремя.Доступность = Истина;
		Элементы.СБВремя2.Доступность = Истина;
		//Объект.СБВремя = Объект.Время;
		//Объект.СБВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.СБВремя = Неопределено;
		Объект.СБВремя2 = Неопределено;
		Элементы.СБВремя.Доступность = Ложь;
		Элементы.СБВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Элементы.ВСВремя.Доступность = Истина;
		Элементы.ВСВремя2.Доступность = Истина;
		//Объект.ВСВремя = Объект.Время;
		//Объект.ВСВремя2 = Объект.ВремяОкончания;
	Иначе
		Объект.ВСВремя = Неопределено;
		Объект.ВСВремя2 = Неопределено;
		Элементы.ВСВремя.Доступность = Ложь;
		Элементы.ВСВремя2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьВремени();
	//ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщееВремя(Команда)
	
	Если Объект.ПН Тогда
		Объект.ПНВремя = Объект.Время;
		Объект.ПНВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Объект.ВТВремя = Объект.Время;
		Объект.ВТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Объект.СРВремя = Объект.Время;
		Объект.СРВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Объект.ЧТВремя = Объект.Время;
		Объект.ЧТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Объект.ПТВремя = Объект.Время;
		Объект.ПТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Объект.СБВремя = Объект.Время;
		Объект.СБВремя2 = Объект.ВремяОкончания;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Объект.ВСВремя = Объект.Время;
		Объект.ВСВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Продолжительность) или НЕ ЗначениеЗаполнено(Объект.Время) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВремяОкончания = Объект.Время - ('00010101'-Объект.Продолжительность);
	
	//Если Объект.ПН Тогда
	//	Объект.ПНВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.ВТ Тогда
	//	Объект.ВТВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.СР Тогда
	//	Объект.СРВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.ЧТ Тогда
	//	Объект.ЧТВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.ПТ Тогда
	//	Объект.ПТВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.СБ Тогда
	//	Объект.СБВремя2 = Объект.ВремяОкончания;
	//КонецЕсли;
	//
	//Если Объект.ВС Тогда
	//	Объект.ВСВремя2 = Объект.ВремяОкончания;
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Время) и ЗначениеЗаполнено(Объект.ВремяОкончания) Тогда
		Объект.Продолжительность = '00010101' + (Объект.ВремяОкончания - Объект.Время);
	КонецЕсли;	
	
КонецПроцедуры

