
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСтрок 	= 17;
	
	СтрокаЦветов = "Белый,Белоснежный,ДымчатоБелый,ПризрачноБелый,ЦветокБелый,СтароеКружево,"
	+"Перламутровый,ТусклоРозовый,ГолубойСКраснымОттенком,Льняной,БледноЛиловый,АкварельноСиний,"
	+"Кремовый,МятныйКрем,ЦианСветлый,Лазурный,Роса,СлоноваяКость,Бежевый,ШелковыйОттенок,АнтикБелый,"
	+"ТопленоеМолоко,БледноМиндальный,СветлоКоричневый,Персиковый,ЗамшаСветлый,НавахоБелый,Пшеничный,"
	+"РыжеватоКоричневый,СветлоЖелтый,СветлоЖелтыйЗолотистый,Лимонный,Желтый,Золотой,СветлоЗолотистый,"
	+"БледноЗолотистый,Хаки,Золотистый,ТемноЗолотистый,ПесочноКоричневый,Оранжевый,ТемноОранжевый,"
	+"ОранжевоКрасный,Томатный,Коралловый,ЛососьСветлый,Лосось,ЛососьТемный,Шоколадный,НейтральноКоричневый,"
	+"Охра,Коричневый,ТемноБордовый,ТемноКрасный,КожаноКоричневый,Кирпичный,Киноварь,СветлоКоралловый,"
	+"Древесный,Малиновый,Красный,Розовый,СветлоРозовый,ТеплоРозовый,НасыщенноРозовый,БледноКрасноФиолетовый,"
	+"РозовоКоричневый,БледноСиреневый,Сливовый,Фиолетовый,Фуксия,Фуксин,НейтральноФиолетовоКрасный,"
	+"КрасноФиолетовый,Орхидея,ОрхидеяНейтральный,ОрхидеяТемный,ТемноФиолетовый,ФуксинТемный,Пурпурный,"
	+"Индиго,СинеФиолетовый,ГрифельноСиний,НейтральноПурпурный,НейтральноГрифельноСиний,Васильковый,"
	+"СветлоГрифельноСиний,КоролевскиГолубой,ТемноГрифельноСиний,ПолночноСиний,Ультрамарин,ТемноСиний,"
	+"НейтральноСиний,Синий,СинеСерый,НасыщенноНебесноГолубой,СветлоНебесноГолубой,НебесноГолубой,"
	+"СинийСоСтальнымОттенком,ГолубойСоСтальнымОттенком,Голубой,СинийСПороховымОттенком,БледноБирюзовый,"
	+"ТемноБирюзовый,НейтральноБирюзовый,Бирюзовый,ЦианАкварельный,Циан,Аквамарин,НейтральноАквамариновый,"
	+"БледноЗеленый,СветлоЗеленый,НейтральноЗеленый,ЗеленоЖелтый,НейтральноВесеннеЗеленый,ВесеннеЗеленый,"
	+"ЗеленаяЛужайка,ЗеленоватоЖелтый,ЗеленоватоЛимонный,ЛимонноЗеленый,ЦветМорскойВолныНейтральный,"
	+"ЖелтоЗеленый,ЦветМорскойВолны,ЦветМорскойВолныТемный,ЦветМорскойВолныСветлый,СероСиний,ЦианТемный,"
	+"ЦианНейтральный,ХакиТемный,Оливковый,ТемноОливковоЗеленый,ТусклоОливковый,ЗеленыйЛес,Зеленый,"
	+"ТемноЗеленый,ТемноГрифельноСерый,СветлоГрифельноСерый,ГрифельноСерый,СеребристоСерый,Серебряный,"
	+"СветлоСерый,ТемноСерый,НейтральноСерый,Серый,ТусклоСерый,Черный";
	
	СоздатьКнопкиЦветов();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиЦветов()
	
	//При повторном вызове нужно УдалитьСтарыеКнопки();
	
	
	ГруппаКнопок = Элементы.ГруппаОсновная; 
	
	НомерСтраницыКнопок = 0;
	

	МассивЦветов = МассивЦветовИзСтроки();

	Сч = 0;
		
	КолонкаКнопок = 0;
	СтрокаКнопок = 0;
	
	Для Каждого ИмяЦвета Из МассивЦветов Цикл

		Если СтрокаКнопок = 0 Тогда
		
	      	ИмяГруппы 	= "ГруппаКлавиш"+КолонкаКнопок;
	        НоваяГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаКнопок);
	        НоваяГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	        НоваяГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	        НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение 		= ОтображениеОбычнойГруппы.Нет;
			
		КонецЕсли; 
		
		СтрокаКнопок = СтрокаКнопок + 1;
		
		ИмяКнопки 				= "Клавиша"+КолонкаКнопок+"_"+СтрокаКнопок;
		НоваяКнопка 			= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), НоваяГруппа);
		НоваяКнопка.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;
		НоваяКнопка.ИмяКоманды 	= "ПриНажатиииКнопкиЦвета";
		НоваяКнопка.ЦветФона 	=  WebЦвета[ИмяЦвета];	
		НоваяКнопка.Заголовок 	= ИмяЦвета;
		НоваяКнопка.Ширина		= 20;
		
		НоваяКнопка.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
		НоваяКнопка.РасширеннаяПодсказка.Заголовок = НоваяКнопка.ЦветФона;
		             		
		Если СтрокаКнопок = КоличествоСтрок Тогда
			СтрокаКнопок = 0;
			КолонкаКнопок = КолонкаКнопок + 1;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Функция МассивЦветовИзСтроки()
	
	Многострочка = СтрЗаменить(СтрокаЦветов, ",", Символы.ПС);
	МассивЦветов = Новый Массив;
	Для Инд = 1 По СтрЧислоСтрок(Многострочка) Цикл
		ТекЦвет = сокрлп(СтрПолучитьСтроку(Многострочка, Инд));
		МассивЦветов.Добавить(ТекЦвет);
	КонецЦикла;
	
	Возврат МассивЦветов;
КонецФункции

//Процедура УдалитьСтарыеКнопки()
//	
//	//Удалаяем старые кнопки
//	спУдалить = Новый Массив;
//	ЕстьЧтоУдалять = Истина;
//	Пока ЕстьЧтоУдалять Цикл
//		ЕстьЧтоУдалять = Ложь;
//		
//		Для каждого Элемент Из Элементы Цикл
//			Если (Лев(Элемент.Имя,7) = "Клавиша")
//				ИЛИ(Лев(Элемент.Имя,12) = "ГруппаКлавиш") Тогда
//				Элементы.Удалить(Элемент);
//				ЕстьЧтоУдалять = Истина;
//				Прервать;
//			КонецЕсли; 
//		КонецЦикла; 
//	КонецЦикла; 
//		
//КонецПроцедуры


&НаКлиенте
Процедура ПриНажатиииКнопкиЦвета(Команда)
	
	Закрыть(WebЦвета[ЭтаФорма.ТекущийЭлемент.Заголовок]);
	
КонецПроцедуры





//&НаКлиенте
//Процедура ПриНажатииДемоКнопки(Команда)
//Кнопка = ЭтаФорма.ТекущийЭлемент;
//Обработчик = Новый ОписаниеОповещения("ПриВыбореWebЦвета", ЭтаФорма);
//Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
//ДопПарам = Новый Структура("ИмяКнопки", Кнопка.Имя);
// 
////Если форма общая
//ОткрытьФорму("ОбщаяФорма.ПалитраWebЦветовУправляемая", ДопПарам,,,,, Обработчик, Режим);
// 
////Если встроена в конфигурацию обработкой
//ОткрытьФорму("Обработка.ВыборWebЦвета.Форма.ПалитраWebЦветовУправляемая", ДопПарам,,,,, Обработчик, Режим);
// КонецПроцедуры
// 
//&НаКлиенте
//Процедура ПриВыбореWebЦвета(ВыбраныйWebЦвет, ДополнительныеПараметры) Экспорт
//     Если НЕ ВыбраныйWebЦвет = НеопределеноТогда
//       ИмяКнопки = ЭтаФорма.ТекущийЭлемент.Имя;
//       Элементы[ИмяКнопки].ЦветФона = ВыбраныйWebЦвет;
//        Элементы[ИмяКнопки].Заголовок = ВыбраныйWebЦвет;
//   КонецЕсли;
// КонецПроцедуры