
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)	
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	Объект.ДД.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	Объект.ДД.Очистить();
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

Процедура ЗаполнитьТЧНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Регистратор КАК Регистратор,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.НеИзменять КАК НеИзменять,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрНакопления.УЗ_РасчетыПоЗарплате.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК УЗ_РасчетыПоЗарплатеОстаткиИОбороты
		|ГДЕ
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Организация = &Организация
		|	И УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Педагог = &Педагог";	
	Запрос.УстановитьПараметр("Педагог", Объект.Педагог);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаОкончания));
	РезультатЗапроса = Запрос.Выполнить();	
	Док = РезультатЗапроса.Выбрать();
	
	Пока Док.Следующий() Цикл		
		
		СтрокаТЧ = Объект.ДД.Добавить();
		
		СтрокаТЧ.Комментарий= Док.Комментарий;
		СтрокаТЧ.Документ 	= Док.Регистратор;
		СтрокаТЧ.Начисление = Док.СуммаПриход;
		//СтрокаТЧ.НеИзменять = Док.НеИзменять;
		СтрокаТЧ.КОплате 	= Док.СуммаПриход;
		
	КонецЦикла;
	
	Объект.СуммаДокумента 	= Объект.ДД.Итог("КОплате");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Период.ДатаНачала = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПедагогПриИзменении(Элемент) 	
	Объект.ДД.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДДПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ДД.Итог("КОплате");
КонецПроцедуры

Функция КассаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.УЗ_Касса.Остатки(, ) КАК КассаОстатки
		|ГДЕ
		|	КассаОстатки.Касса = &Касса";  	
	Запрос.УстановитьПараметр("Касса", Объект.Касса);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьОстатокПоКассе(Команда)
	ОстатокВКассе = КассаПриИзмененииНаСервере();	
КонецПроцедуры

Функция ПереместитьДеньгиНаСервере()
	
	НовПеремещение = Документы.УЗ_ПеремещениеДенег.СоздатьДокумент();
	НовПеремещение.ВидОперации 			= Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовПеремещение.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;

	НовПеремещение.АвторДокумента 		= УЗ_Среда.ТекущийПользователь();
	НовПеремещение.КассаОтправитель		= Объект.Касса;
	НовПеремещение.КассаПолучатель		= Справочники.УЗ_Кассы.ПолучитьОсновнуюКассу();
	НовПеремещение.Клиент 				= Объект.Педагог;
	НовПеремещение.Сумма 				= КассаПриИзмененииНаСервере();
	НовПеремещение.Дата					= Объект.ДатаОкончания-1;
	НовПеремещение.Организация 			= Объект.Организация;
	
	Попытка
		НовПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовПеремещение.Ссылка;
	Исключение
		Сообщить("Не удалось провести Перемещение!"+ " " +ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ПереместитьДеньги(Команда)
	               	
	Если ЗначениеЗаполнено(Объект.Перемещение) Тогда
		Сообщить("Невозможно создать еще одно Перемещение! Существует уже созданное ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.Перемещение = ПереместитьДеньгиНаСервере();
		//ОткрытьЗначение(Объект.Перемещение);
	Иначе
		Сообщить("Невозможно создать Перемещение! Возможно незаполнены поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ДД.Итог("Начисления");
КонецПроцедуры

Функция СделтьРКОНаСервере()
	
	НовРКО = Документы.УЗ_РасходДенег.СоздатьДокумент();
	НовРКО.ВидОперации 			= Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовРКО.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;
	НовРКО.АвторДокумента 		= УЗ_Среда.ТекущийПользователь();
	НовРКО.Касса 				= Объект.Касса;
	НовРКО.ФизЛицо 			= Объект.Педагог;
	НовРКО.Организация 			= Объект.Организация;
	НовРКО.СуммаДокумента 		= Объект.СуммаДокумента;
	НовРКО.Дата					= Объект.ДатаОкончания-1;
	
	Попытка
		НовРКО.Записать(РежимЗаписиДокумента.Проведение);		
		Возврат НовРКО.Ссылка;
	Исключение
		Сообщить("Не удалось провести РКО!"+ " " +ОписаниеОшибки());
	КонецПопытки;

	Возврат Документы.УЗ_РасходДенег.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура СделтьРКО(Команда)

	Оповещение = Новый ОписаниеОповещения("СделтьРКОЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Создать расходный кассовый ордер на выплату зарплаты?", РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура СделтьРКОЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РКО) Тогда
		Сообщить("Невозможно создать еще один Расходный ордер! Существует уже созданный ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.РКО = СделтьРКОНаСервере();
		Если ЗначениеЗаполнено(Объект.РКО) Тогда
			Записать();
		КонецЕсли;
		//ОткрытьЗначение(Объект.РКО);
		ПроверитьРКО()
	Иначе
		Сообщить("РКО невозможно создать! Не заполнены обязательные поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//TODO УЗ: даты запрета
//	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ПроверитьРКО();
КонецПроцедуры

Процедура ПроверитьРКО()
	Если Объект.Проведен Тогда
		Если ЗначениеЗаполнено(Объект.РКО) и Объект.РКО.Проведен Тогда
			Элементы.ДекорацияВыплачено.Видимость = Истина;
			Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Зеленый;
			Элементы.ДекорацияВыплачено.Заголовок = "ВЫПЛАЧЕНО ПОЛНОСТЬЮ!";
			Элементы.РКО.ЦветФона = WebЦвета.СветлоЗеленый;
			Если Объект.СуммаДокумента > Объект.РКО.СуммаДокумента Тогда
				Элементы.ДекорацияВыплачено.Заголовок = "ВЫПЛАЧЕН НЕ ПОЛНОСТЬЮ!";
				Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Оранжевый;
				Элементы.РКО.ЦветФона = WebЦвета.Оранжевый;
			ИначеЕсли Объект.СуммаДокумента < Объект.РКО.СуммаДокумента Тогда
				Элементы.ДекорацияВыплачено.Заголовок = "ПЕРЕПЛАЧЕНО!";
				Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Фиолетовый;
				Элементы.РКО.ЦветФона = WebЦвета.Фиолетовый;
			КонецЕсли;			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.РКО) Тогда
			Элементы.ДекорацияВыплачено.Видимость = Истина;
			Элементы.ДекорацияВыплачено.Заголовок = "НЕ ВЫПЛАЧЕНО!";
			Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Оранжевый;
			Элементы.РКО.ЦветФона = Новый Цвет();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПроверитьРКО();
КонецПроцедуры 

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	ПроверитьРКО();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";	
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры
