
&НаКлиенте
Процедура СделатьОсновной(Команда)
	СделатьОсновнойНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура СделатьОсновнойНаСервере()
	
	НоваяКасса = Элементы.Список.ТекущаяСтрока;
	
	СтараяКасса = Справочники.Кассы.НайтиПоРеквизиту("Основная",Истина);
	
	Если ЗначениеЗаполнено(СтараяКасса) Тогда
		Если НоваяКасса <> СтараяКасса Тогда
			СтараяКасса = СтараяКасса.ПолучитьОбъект();
			СтараяКасса.Основная = Ложь;
			
			Попытка 
				СтараяКасса.Записать();
				НоваяКасса = НоваяКасса.ПолучитьОбъект();
				НоваяКасса.Основная = Истина;
				НоваяКасса.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	Иначе
		НоваяКасса = НоваяКасса.ПолучитьОбъект();
		НоваяКасса.Основная = Истина;
		НоваяКасса.Записать();
	КонецЕсли; 

КонецПроцедуры

