

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ЦеныТарифов.Параметры.УстановитьЗначениеПараметра("Тариф",Объект.Ссылка); 

КонецПроцедуры

//&НаКлиенте
//Процедура ЦеныТарифовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		
//		Режим = РежимДиалогаВопрос.ДаНет;
//		Ответ = Вопрос("Тариф еще не записан! Записать?", Режим, 0);
//		Если Ответ = КодВозвратаДиалога.Нет Тогда
//			Возврат;
//		Иначе
//			ЗаписатьОбъектНаСервере();
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры
&НаСервере
Процедура ЗаписатьОбъектНаСервере() 
	Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Элементы.ЦеныТарифов.Обновить();
	ЦеныТарифов.Параметры.УстановитьЗначениеПараметра("Тариф",Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЦену(Команда) 	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Тариф еще не записан! Записать?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЗаписатьОбъектНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Тариф", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.LM_ЦеныТарифов.Форма.ФормаЗаписиТолькоЧтение",ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно);

КонецПроцедуры
