
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	Если Объект.ТЗСписаниеКасса.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаДокумент2;
	ИначеЕсли Объект.ДисконтныеКарты.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаДокумент1;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиПоДисконтнымКартам(Команда)
	ЗаполнитьОстаткамиПоДисконтнымКартамНаСервере();
	ОбновитьОтображение();
КонецПроцедуры

Процедура ЗаполнитьОстаткамиПоДисконтнымКартамНаСервере()
	
	Если Объект.Проведен Тогда //Отмена проведения
		Сообщить("Необходимо отменить проведение для формирования списания остатков!" );
		Возврат;
	КонецЕсли;

	Объект.ДисконтныеКарты.Очистить();
	Объект.ТЗСписания.Очистить();
	Объект.Сумма = 0;
	Объект.СуммаБонусов = 0;
	Объект.КоличествоЧасов = 0;
	
	Если ЗначениеЗаполнено(Объект.Ученик) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДисконтныхКартОстатки.Клиент КАК Клиент,
		|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток,
		|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта
		|ИЗ
		|	РегистрНакопления.LM_ДвижениеДисконтныхКарт.Остатки(&Дата, ) КАК ДвижениеДисконтныхКартОстатки
		|ГДЕ
		|	ДвижениеДисконтныхКартОстатки.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ДисконтнаяКарта
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Клиент", Объект.Ученик);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДисконтныхКартОстатки.Клиент КАК Клиент,
		|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток
		|ИЗ
		|	РегистрНакопления.LM_ДвижениеДисконтныхКарт.Остатки(&Дата, ) КАК ДвижениеДисконтныхКартОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ДисконтнаяКарта
		|АВТОУПОРЯДОЧИВАНИЕ"; 		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),КонецДня(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ДисконтныеКарты.Добавить();
		НовСтр.ДисконтнаяКарта	= ВыборкаДетальныеЗаписи.ДисконтнаяКарта;
		НовСтр.СуммаБонусов 	= ВыборкаДетальныеЗаписи.СуммаБонусовОстаток;
	КонецЦикла;
	
	Объект.СуммаБонусов 	= Объект.ДисконтныеКарты.Итог("СуммаБонусов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	 Если Объект.ТЗСписания.Количество()>0 Тогда
		Элементы.ГруппаДокумент.Заголовок = "Взаиморасчеты (" +Объект.ТЗСписания.Количество()+")";
	КонецЕсли;
	
	Если Объект.ДисконтныеКарты.Количество()>0 Тогда
		Элементы.ГруппаДокумент1.Заголовок = "Бонусы (" +Объект.ДисконтныеКарты.Количество()+")";
	КонецЕсли;
	
	Если Объект.ТЗСписаниеКасса.Количество()>0 Тогда
		Элементы.ГруппаДокумент2.Заголовок = "Касса (" +Объект.ТЗСписаниеКасса.Количество()+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписанияПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	С = Новый Структура;
	С.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.LM_ДвиженияДокумента.Форма.ДвиженияДокумента",С ,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


