
&НаКлиенте
Процедура Активировать(Команда)
	Объект.Активный = НЕ Объект.Активный;
	Если Объект.Активный Тогда
		Объект.ДатаАктивации = ТекущаяДата();	
	КонецЕсли;  	
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Заморозить(Команда)
	Если Объект.Активный Тогда
		Объект.Заморозка = НЕ Объект.Заморозка;
		Если Объект.Заморозка Тогда
			Объект.ДатаЗаморозки = ТекущаяДата();
		КонецЕсли;
		ОбновитьВидимость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Элементы.Период.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Период.ТолькоПросмотр = Ложь;;
	КонецЕсли;
	
	Период.ДатаНачала 		= Объект.ДатаНачала;
	Период.ДатаОкончания 	= Объект.ДатаОкончания;
	
	Если Объект.Активный Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаЗаморозки) Тогда
			Элементы.ДатаЗаморозки.Заголовок = "Дата последней заморозки";
		КонецЕсли; 
	
		Элементы.ГруппаЗаморозка.Доступность = Истина;
		Если Объект.Заморозка Тогда
			Элементы.Активировать.Заголовок 		= "Блокировать";
			Элементы.Активировать.ЦветФона 			= WebЦвета.ТусклоРозовый;
			Элементы.Заморозить.Заголовок 			= "Разморозить";
			Элементы.ДекорацияСтатус.Заголовок 		= "Заморожен";
			Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.Циан;
			Элементы.СрокЗамрозки.ТолькоПросмотр 	= Истина;
		Иначе
			Элементы.ДекорацияСтатус.Заголовок 		= "Активен";
			Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.ЗеленоватоЖелтый;
			Элементы.Заморозить.Заголовок 			= "Заморозить";
			Элементы.СрокЗамрозки.ТолькоПросмотр 	= Ложь;
		КонецЕсли;
	Иначе
		Элементы.Активировать.Заголовок 		= "Активировать";
		Элементы.Активировать.ЦветФона 			= WebЦвета.ЗеленоватоЖелтый;
		Элементы.ДекорацияСтатус.Заголовок 		= "Неактивен";
		Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.СветлоСерый;
		Элементы.ГруппаЗаморозка.Доступность 	= Ложь;
	КонецЕсли;
		
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Уроки.Параметры.УстановитьЗначениеПараметра("Абонемент", Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьФизЛицо(Команда)
	Элементы.ФизЛицо.ТолькоПросмотр = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьПериод(Команда)
	Элементы.Период.ТолькоПросмотр = Ложь;
КонецПроцедуры

