&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	
	ОтобразитьФото();	
КонецПроцедуры






&НаКлиенте
Процедура ВыбратьФото(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,,,Истина,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	Фото = Адрес;
	Объект.Фото = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотоОчистка(Элемент, СтандартнаяОбработка)
	Фото = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ФотоПриИзменении(Элемент) 	
	ОтобразитьФото();
КонецПроцедуры
&НаСервере
Процедура ОтобразитьФото()
	Попытка
		Фото = ПоместитьВоВременноеХранилище(Объект.Фото.Файл.Получить());
	Исключение
		Фото = "";
	КонецПопытки;	
КонецПроцедуры




&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Фото) и ЗначениеЗаполнено(Фото) Тогда
		НовыйФайлКартинки = Справочники.LM_Фото.СоздатьЭлемент();
		НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
		НовыйФайлКартинки.Наименование = ТекущийОбъект.Наименование;
		НовыйФайлКартинки.Записать();
		ТекущийОбъект.Фото = НовыйФайлКартинки.Ссылка;
	КонецЕсли;     	
	
КонецПроцедуры






&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
		Попытка
			Элементы.ПриНажатииКнопкиВыборЦвета.ЦветФона = WebЦвета[Объект.Цвет];
			Элементы.ПриНажатииКнопкиВыборЦвета.Заголовок = WebЦвета[Объект.Цвет];
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииКнопкиВыборЦвета(Команда)
	
	Кнопка = ЭтаФорма.ТекущийЭлемент;
	
	Обработчик = Новый ОписаниеОповещения("ПриВыбореWebЦвета", ЭтаФорма);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ДопПарам = Новый Структура("ИмяКнопки", Кнопка.Имя);
	
	//Форма текущей демо обработки
	ОткрытьФорму("Обработка.LM_ВыборWebЦвета.Форма.ПалитраWebЦветовУправляемая", ДопПарам,,,,, Обработчик, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореWebЦвета(ВыбраныйWebЦвет, ДополнительныеПараметры) Экспорт
	
	//Обработка выбора цветв
	Если НЕ ВыбраныйWebЦвет = Неопределено Тогда
		ИмяКнопки = ЭтаФорма.ТекущийЭлемент.Имя;
		Элементы[ИмяКнопки].ЦветФона  = ВыбраныйWebЦвет;
		Элементы[ИмяКнопки].Заголовок = ВыбраныйWebЦвет;
		Попытка
			ВыбЦвет = Сред(ВыбраныйWebЦвет,0,Найти(ВыбраныйWebЦвет,"(")-2);
			ВыбЦвет = СтрЗаменить(ВыбЦвет,"-","");
			ВыбЦвет = СтрЗаменить(ВыбЦвет," ","");
			Объект.Цвет = ВыбЦвет;
		Исключение
			Объект.Цвет = ВыбраныйWebЦвет; 
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

