
&НаКлиенте
Процедура LM_ИспользоватьКомпактныйИнтерфейсПриИзменении(Элемент)
	ИспользоватьКомпактныйИнтерфейсПриИзмененииНаСервере();
	Сообщить("После изменения варианта масштаба интерфейса необходимо перезапустить программу!");
КонецПроцедуры

Процедура ИспользоватьКомпактныйИнтерфейсПриИзмененииНаСервере()
	
	//Режим = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	//Режим = ВариантМасштабаФормКлиентскогоПриложения.Обычный;
	//Режим = ВариантМасштабаФормКлиентскогоПриложения.Авто;
	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,,ИмяПользователя());
	Если НастройкиКлиентскогоПриложения = Неопределено Тогда
		НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения;		
	КонецЕсли;
	НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения=ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	Если НаборКонстант.LM_ИспользоватьКомпактныйИнтерфейс Тогда
		НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	Иначе
		НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Авто;
	КонецЕсли;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКлиентскогоПриложения, , ИмяПользователя());
	
КонецПроцедуры