
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.LM_НачислениеБонусов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеБонусов.АвторДокумента КАК АвторДокумента,
	|	НачислениеБонусов.Дата КАК Дата,
	|	НачислениеБонусов.Комментарий КАК Комментарий,
	|	НачислениеБонусов.Номер КАК Номер,
	|	НачислениеБонусов.СуммаБонусов КАК СуммаБонусов,
	|	НачислениеБонусов.ДисконтныеКарты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДисконтнаяКарта.Владелец КАК Ученик,
	|		ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		СуммаБонусов КАК СуммаБонусов,
	|		ДисконтнаяКарта.ДатаОкончанияДействия КАК ДатаСписания
	|	) КАК ДисконтныеКарты,
	|	НачислениеБонусов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.LM_НачислениеБонусов КАК НачислениеБонусов
	|ГДЕ
	|	НачислениеБонусов.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДисконтныеКартыШапка = Макет.ПолучитьОбласть("ДисконтныеКартыШапка");
	ОбластьДисконтныеКарты = Макет.ПолучитьОбласть("ДисконтныеКарты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если Выборка.Ссылка.ДисконтныеКарты.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьДисконтныеКартыШапка);
		ВыборкаДисконтныеКарты = Выборка.ДисконтныеКарты.Выбрать();
		Пока ВыборкаДисконтныеКарты.Следующий() Цикл
			ОбластьДисконтныеКарты.Параметры.Заполнить(ВыборкаДисконтныеКарты);
			ТабДок.Вывести(ОбластьДисконтныеКарты, ВыборкаДисконтныеКарты.Уровень());
		КонецЦикла;
		КонецЕсли;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
