
Процедура ПриКопировании(ОбъектКопирования)
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	Приостановка = Неопределено;
	Активный = Неопределено;
	КоличествоЗанятий = Неопределено;
	КоличествоЧасов = Неопределено;
	Комментарий = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ДатаНачала) и ДатаНачала > ДатаОкончания Тогда
		Сообщить("Ошибка! Дата начала больше даты окончания!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Активный Тогда    		
		Если ДатаНачала >= ДатаПриостановки или ДатаОкончания <= ДатаВозобновления или ДатаПриостановки >= ДатаВозобновления Тогда
			Сообщить("Ошибка в датах приостановок!");
			Если Приостановка Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;         	
	КонецЕсли;             	

КонецПроцедуры
