
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.LM_СписаниеОстатков.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеОстатков.АвторДокумента КАК АвторДокумента,
	|	СписаниеОстатков.Дата КАК Дата,
	|	СписаниеОстатков.КоличествоЧасов КАК КоличествоЧасов,
	|	СписаниеОстатков.Комментарий КАК Комментарий,
	|	СписаниеОстатков.Номер КАК Номер,
	|	СписаниеОстатков.Сумма КАК Сумма,
	|	СписаниеОстатков.СуммаБонусов КАК СуммаБонусов,
	|	СписаниеОстатков.ТЗСписания.(
	|		НомерСтроки КАК НомерСтроки,
	|		Ученик КАК Ученик,
	|		Педагог КАК Педагог,
	|		Тариф КАК Тариф,
	|		КоличествоЧасов КАК КоличествоЧасов,
	|		Сумма КАК Сумма,
	|		ГруппаОбучения КАК ГруппаОбучения,
	|		ПредметОбучения КАК ПредметОбучения
	|	) КАК ТЗСписания,
	|	СписаниеОстатков.ДисконтныеКарты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДисконтнаяКарта.Владелец КАК Ученик,
	|		ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		СуммаБонусов КАК СуммаБонусов,
	|		ДисконтнаяКарта.ДатаОкончанияДействия КАК ДатаСписания
	|	) КАК ДисконтныеКарты,
	|	СписаниеОстатков.ТЗСписаниеКасса.(
	|		НомерСтроки КАК НомерСтроки,
	|		Ученик КАК Ученик,
	|		СтатьяЗатрат КАК СтатьяЗатрат,
	|		Касса КАК Касса,
	|		ПредметОбучения КАК ПредметОбучения,
	|		ВидОперации КАК ВидОперации,
	|		Сумма КАК Сумма
	|	) КАК ТЗСписаниеКасса,
	|	СписаниеОстатков.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.LM_СписаниеОстатков КАК СписаниеОстатков
	|ГДЕ
	|	СписаниеОстатков.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЗСписанияШапка = Макет.ПолучитьОбласть("ТЗСписанияШапка");
	ОбластьТЗСписания = Макет.ПолучитьОбласть("ТЗСписания");
	ОбластьДисконтныеКартыШапка = Макет.ПолучитьОбласть("ДисконтныеКартыШапка");
	ОбластьДисконтныеКарты = Макет.ПолучитьОбласть("ДисконтныеКарты");
	ОбластьТЗСписаниеКассаШапка = Макет.ПолучитьОбласть("ТЗСписаниеКассаШапка");
	ОбластьТЗСписаниеКасса = Макет.ПолучитьОбласть("ТЗСписаниеКасса");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если Выборка.Ссылка.ТЗСписания.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьТЗСписанияШапка);
		ВыборкаТЗСписания = Выборка.ТЗСписания.Выбрать();
		Пока ВыборкаТЗСписания.Следующий() Цикл
			ОбластьТЗСписания.Параметры.Заполнить(ВыборкаТЗСписания);
			ТабДок.Вывести(ОбластьТЗСписания, ВыборкаТЗСписания.Уровень());
		КонецЦикла;
		КонецЕсли;

		Если Выборка.Ссылка.ДисконтныеКарты.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьДисконтныеКартыШапка);
		ВыборкаДисконтныеКарты = Выборка.ДисконтныеКарты.Выбрать();
		Пока ВыборкаДисконтныеКарты.Следующий() Цикл
			ОбластьДисконтныеКарты.Параметры.Заполнить(ВыборкаДисконтныеКарты);
			ТабДок.Вывести(ОбластьДисконтныеКарты, ВыборкаДисконтныеКарты.Уровень());
		КонецЦикла;
		КонецЕсли;

		Если Выборка.Ссылка.ТЗСписаниеКасса.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьТЗСписаниеКассаШапка);
		ВыборкаТЗСписаниеКасса = Выборка.ТЗСписаниеКасса.Выбрать();
		Пока ВыборкаТЗСписаниеКасса.Следующий() Цикл
			ОбластьТЗСписаниеКасса.Параметры.Заполнить(ВыборкаТЗСписаниеКасса);
			ТабДок.Вывести(ОбластьТЗСписаниеКасса, ВыборкаТЗСписаниеКасса.Уровень());
		КонецЦикла;
		КонецЕсли;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
