
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Фото = Неопределено;
	
	#Если НЕ ВебКлиент Тогда		
		РассчитатьЗадолженнсоть(Элемент.ТекущаяСтрока);
	#КонецЕсли
	
	ПоказатьФото(); 
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьФото()
	
	Попытка
		Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока.Фото) Тогда
			Фото = ПоместитьВоВременноеХранилище(Элементы.Список.ТекущаяСтрока.Фото.Файл.Получить());	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗадолженнсоть(ФизЛицо)
	
	ЭтотОбъект.Задолженность = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) или ФизЛицо.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУроки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Остатки(, ) КАК СписанияСуммЗаУроки
		|ГДЕ
		|	СписанияСуммЗаУроки.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтотОбъект.Задолженность = ВыборкаДетальныеЗаписи.СуммаОстаток;
		//ЭтотОбъект.ОстатокЧасов = Дата("01.01.0001 0:00:00") + ВыборкаДетальныеЗаписи.ЧасыОстаток;
	КонецЦикла; 	

КонецПроцедуры

&НаСервере
Функция ОткрытьВзаиморасчетыНаСервере()
	
	КомпоновщикНастроек = Отчеты.LM_Взаиморасчеты.Создать().КомпоновщикНастроек; 
	Настройки 			= КомпоновщикНастроек.Настройки; 
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
	//ЭлементНастройки.Значение.ДатаНачала    = '00010101';//НачалоГода(ТекущаяДата());
	//ЭлементНастройки.Значение.ДатаОкончания = '00010101';//КонецГода(ТекущаяДата());
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			//ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
			ПользовательскийПараметр.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	ОтборУченик = Новый ПолеКомпоновкиДанных("Клиент");
	//ОтборПериод = Новый ПолеКомпоновкиДанных("Период");
	
	Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл 
		Если ЭлементНастройки.ЛевоеЗначение = ОтборУченик Тогда 
			ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементНастройки.ПравоеЗначение = Элементы.Список.ВыделенныеСтроки[0]; 
			ЭлементНастройки.Использование = Истина; 
			Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
				ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
				Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
					ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
					ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
					ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
				КонецЕсли; 
			КонецЕсли;
			Прервать; 
		КонецЕсли; 
	КонецЦикла; 
	
	ПараметрыОткрытия = Новый Структура(); 
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина); 
	ПараметрыОткрытия.Вставить("Вариант", Настройки); 
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаКлиенте
Процедура ЗадолженностьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		Если ЗначениеЗаполнено(Элементы.Список.ВыделенныеСтроки[0]) Тогда		
			ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере();
			ОткрытьФорму("Отчет.LM_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
		Иначе
			ОткрытьФорму("Отчет.LM_Взаиморасчеты.Форма", , ЭтаФорма);
		КонецЕсли;
	Исключение
		ОткрытьФорму("Отчет.LM_Взаиморасчеты.Форма", , ЭтаФорма);
	КонецПопытки;
КонецПроцедуры
