
&НаСервере
Процедура НачатьНаСервере()
	
	ТЗ.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";	
	РезультатЗапроса = Запрос.Выполнить(); 	
	ФизЛица = РезультатЗапроса.Выбрать();
	
	Сч = 0;
	
	Пока ФизЛица.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ФизЛица.Ссылка.Статус) Тогда			
			Если ФизЛица.Ссылка.Статус.ЗащитаОтИзменений Тогда
				Продолжить;                                               
			КонецЕсли;			
		КонецЕсли;		
		
		Остаток 			= ПолучитьОстаток(ФизЛица.Ссылка);
		КоличествоУроков 	= ПолучитьКоличествоУроков(ФизЛица.Ссылка);
		КоличествоОплат		= ПолучитьКоличествоОплат(ФизЛица.Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыФизЛиц.Ссылка
		|ИЗ
		|	Справочник.LM_СтатусыФизЛиц КАК СтатусыФизЛиц
		|ГДЕ
		|	СтатусыФизЛиц.ПометкаУдаления = ЛОЖЬ
		|	И СтатусыФизЛиц.Активно = ИСТИНА";	
		РезультатЗапроса = Запрос.Выполнить(); 	
		Статусы = РезультатЗапроса.Выбрать(); 	
		Пока Статусы.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Статусы.Ссылка.ИзменятьСтатус) Тогда
				
				Если ФизЛица.Ссылка.Статус = Статусы.Ссылка Тогда
					Продолжить;
				КонецЕсли;
				
				СтарыйСтатус = ФизЛица.Ссылка.Статус;
				НовыйСтатус  = Неопределено;								
				
				Выполнить("Если " +Статусы.Ссылка.ИзменятьСтатус+ " Тогда" +Символы.ПС
				+"НовыйСтатус = Статусы.Ссылка;"+Символы.ПС
				+"КонецЕсли;");
				
				Если НовыйСтатус <> Неопределено Тогда					
					Если СтарыйСтатус <> НовыйСтатус Тогда
						Сч = Сч + 1;
						НовСтрТЗ = ТЗ.Добавить();
						НовСтрТЗ.НомерСтроки = Сч;
						НовСтрТЗ.ФизЛицо = ФизЛица.Ссылка;
						НовСтрТЗ.СтарыйСтатус = СтарыйСтатус;
						НовСтрТЗ.НовыйСтатус = НовыйСтатус;
						НовСтрТЗ.Остаток = Остаток;
						НовСтрТЗ.КоличествоУроков = КоличествоУроков;
						НовСтрТЗ.КоличествоОплат = КоличествоОплат;
						НовСтрТЗ.Формула = "Если " +НовыйСтатус.ИзменятьСтатус;
					КонецЕсли;					
				КонецЕсли;			
								
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьОстаток(ФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУрокиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Остатки КАК СписанияСуммЗаУрокиОстатки
		|ГДЕ
		|	СписанияСуммЗаУрокиОстатки.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", ФизЛицо); 	
	РезультатЗапроса = Запрос.Выполнить(); 	
	Остаток = РезультатЗапроса.Выбрать();
	
	Пока Остаток.Следующий() Цикл
		Возврат Остаток.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьКоличествоУроков(ФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СУММА(1) КАК Кол
		|ИЗ
		|	Документ.LM_Урок.Ученики КАК УрокУченики
		|ГДЕ
		|	УрокУченики.Ссылка.Проведен = ИСТИНА
		|	И УрокУченики.Ученик = &Ученик";
	
	Запрос.УстановитьПараметр("Ученик", ФизЛицо); 	
	РезультатЗапроса = Запрос.Выполнить(); 	
	КоличествоУроков = РезультатЗапроса.Выбрать();
	
	Пока КоличествоУроков.Следующий() Цикл
		Если КоличествоУроков.Кол = NULL Тогда
			Возврат 0;
		Иначе
			Возврат КоличествоУроков.Кол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьКоличествоОплат(ФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СУММА(1) КАК Кол
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПКО
		|ГДЕ
		|	ПКО.Проведен = ИСТИНА
		|	И ПКО.Клиент = &Клиент";	
	Запрос.УстановитьПараметр("Клиент", ФизЛицо); 	
	РезультатЗапроса = Запрос.Выполнить(); 	
	КоличествоОплат = РезультатЗапроса.Выбрать();
	
	Пока КоличествоОплат.Следующий() Цикл
		Если КоличествоОплат.Кол = NULL Тогда
			Возврат 0;
		Иначе
			Возврат КоличествоОплат.Кол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции


&НаКлиенте
Процедура Начать(Команда)
	НачатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСервере()
	
	Для Каждого Стр из ТЗ Цикл 
		
		Если НЕ Стр.Выб Тогда
			Продолжить;
		КонецЕсли;
		   		
		ФизЛицоОбъект = Стр.ФизЛицо.ПолучитьОбъект();
		ФизЛицоОбъект.Статус = Стр.НовыйСтатус;
		
		Попытка
			ФизЛицоОбъект.Записать();
		Исключение
			Сообщить("Не удалось записать " +Стр.ФизЛицо+ " " +ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
	Состояние("Выполнено!");
	НачатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Стр из ТЗ Цикл
		Стр.Выб = Истина;
	КонецЦикла;	
КонецПроцедуры
