
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Убираем доступ к изменению периода у Менеджеров. Период видимости документов = 1 неделя (с вторника по вторник)
	LMНастроки = РегистрыСведений.LM_Настройки.ПолучитьПоследнее(ТекущаяДата());
	Если LMНастроки.Свойство("ДатаЗапретаРедактирования") Тогда
		Если РольДоступна("LM_Менеджер") и Не РольДоступна("ПолныеПрава") И LMНастроки.ДатаЗапретаРедактированияНеделяеля Тогда    
			НеделяНазад = НачалоДня(НачалоДня(ТекущаяДата())-604800);
			ЭтотОбъект.ПодчиненныеЭлементы.Список.Период.ДатаНачала = НеделяНазад;
			ЭтотОбъект.ПодчиненныеЭлементы.Список.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
			Элементы.СписокСостояниеПросмотра.Доступность = Ложь;
			Элементы.ФормаУстановитьИнтервал.Доступность = Ложь;
			ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаУстановитьИнтервал.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

