
Процедура ПередЗаписью(Отказ)
	
	Если ПН и НЕ ЗначениеЗаполнено(ПНВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если ВТ и НЕ ЗначениеЗаполнено(ВТВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если СР и НЕ ЗначениеЗаполнено(СРВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если ЧТ и НЕ ЗначениеЗаполнено(ЧТВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если ПТ и НЕ ЗначениеЗаполнено(ПТВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если СБ и НЕ ЗначениеЗаполнено(СБВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	Если ВС и НЕ ЗначениеЗаполнено(ВСВремя) Тогда
		Сообщить("Не заполнено время у выбранного дня недели!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
