
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		
		КолДней = Число(Лев(КонецМесяца(Объект.Дата),2));
		
		Объект.ТЧ.Очистить();
		
		ДеньНедели = "";
		РДата = Неопределено;
		
		Для i=0 по КолДней-1 Цикл
			
			Если i = 0 Тогда
				РДата = НачалоМесяца(Объект.Дата);
			Иначе
				РДата = НачалоМесяца(Объект.Дата)+(I*60*60*24);
			КонецЕсли;
			
			ДеньНедели = Строка(Формат(РДата,"ДФ=ддд"));
			
			Если ДеньНедели = "Пн" и НЕ Объект.ПН Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Вт" и НЕ Объект.ВТ Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Ср" и НЕ Объект.СР Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Чт" и НЕ Объект.ЧТ Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Пт" и НЕ Объект.ПТ Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Сб" и НЕ Объект.СБ Тогда
				Продолжить;
			ИначеЕсли ДеньНедели = "Вс" и НЕ Объект.ВС Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтр = Объект.ТЧ.Добавить();
			НовСтр.Дата = РДата;
						
			Если ДеньНедели = "Пн" Тогда
				Если ЗначениеЗаполнено(Объект.ПНВремя) Тогда
					НовСтр.ВремяНачала = Объект.ПНВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ПНВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.ПНВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Вт" Тогда
				Если ЗначениеЗаполнено(Объект.ВТВремя) Тогда
					НовСтр.ВремяНачала = Объект.ВТВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ВТВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.ВТВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Ср" Тогда
				Если ЗначениеЗаполнено(Объект.СРВремя) Тогда
					НовСтр.ВремяНачала = Объект.СРВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.СРВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.СРВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Чт" Тогда
				Если ЗначениеЗаполнено(Объект.ЧТВремя) Тогда
					НовСтр.ВремяНачала = Объект.ЧТВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ЧТВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.ЧТВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Пт" Тогда
				Если ЗначениеЗаполнено(Объект.ПТВремя) Тогда
					НовСтр.ВремяНачала = Объект.ПТВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ПТВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.ПТВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Сб" Тогда
				Если ЗначениеЗаполнено(Объект.СБВремя) Тогда
					НовСтр.ВремяНачала = Объект.СБВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.СБВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.СБВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			ИначеЕсли ДеньНедели = "Вс" Тогда
				Если ЗначениеЗаполнено(Объект.ВСВремя) Тогда
					НовСтр.ВремяНачала = Объект.ВСВремя;
				Иначе
					НовСтр.ВремяНачала = Объект.ВремяНачалаОбщее;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ВСВремя2) Тогда
					НовСтр.ВремяОкончания = Объект.ВСВремя2;
				Иначе
					НовСтр.ВремяОкончания = Объект.ВремяОкончанияОбщее;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НовСтр.ВремяНачала) Тогда
				Сообщить("Не заполнено время начала для " +ДеньНедели);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НовСтр.ВремяОкончания) Тогда
				Сообщить("Не заполнено время окончания для " +ДеньНедели);
			КонецЕсли; 			
			
		КонецЦикла;
		
	Иначе		
		Сообщить("Не задана дата Графика! Возможно график еще не сохранен.");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОбщееВремя(Команда)
	
	Если Объект.ПН Тогда
		Объект.ПНВремя = Объект.ВремяНачалаОбщее;
		Объект.ПНВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Объект.ВТВремя = Объект.ВремяНачалаОбщее;
		Объект.ВТВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Объект.СРВремя = Объект.ВремяНачалаОбщее;
		Объект.СРВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Объект.ЧТВремя = Объект.ВремяНачалаОбщее;
		Объект.ЧТВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Объект.ПТВремя = Объект.ВремяНачалаОбщее;
		Объект.ПТВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Объект.СБВремя = Объект.ВремяНачалаОбщее;
		Объект.СБВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Объект.ВСВремя = Объект.ВремяНачалаОбщее;
		Объект.ВСВремя2 = Объект.ВремяОкончанияОбщее;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПНВремяПриИзменении(Элемент)
	Объект.ПН = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВТВремяПриИзменении(Элемент)
	Объект.ВТ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СРВремяПриИзменении(Элемент)
	Объект.СР = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЧТВремяПриИзменении(Элемент)
	Объект.ЧТ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПТВремяПриИзменении(Элемент)
	Объект.ПТ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СБВремяПриИзменении(Элемент)
	Объект.СБ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВСВремяПриИзменении(Элемент)
	Объект.ВС = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПНПриИзменении(Элемент)
	 ОбновитьДоступностьВремени();		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьВремени()
	
	Если Объект.ПН Тогда
		Элементы.ПНВремя.Доступность = Истина;
		Элементы.ПНВремя2.Доступность = Истина;
	Иначе
		Элементы.ПНВремя.Доступность = Ложь;
		Элементы.ПНВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВТ Тогда
		Элементы.ВТВремя.Доступность = Истина;
		Элементы.ВТВремя2.Доступность = Истина;
	Иначе
		Элементы.ВТВремя.Доступность = Ложь;
		Элементы.ВТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СР Тогда
		Элементы.СРВремя.Доступность = Истина;
		Элементы.СРВремя2.Доступность = Истина;
	Иначе
		Элементы.СРВремя.Доступность = Ложь;
		Элементы.СРВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ЧТ Тогда
		Элементы.ЧТВремя.Доступность = Истина;
		Элементы.ЧТВремя2.Доступность = Истина;
	Иначе
		Элементы.ЧТВремя.Доступность = Ложь;
		Элементы.ЧТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ПТ Тогда
		Элементы.ПТВремя.Доступность = Истина;
		Элементы.ПТВремя2.Доступность = Истина;
	Иначе
		Элементы.ПТВремя.Доступность = Ложь;
		Элементы.ПТВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.СБ Тогда
		Элементы.СБВремя.Доступность = Истина;
		Элементы.СБВремя2.Доступность = Истина;
	Иначе
		Элементы.СБВремя.Доступность = Ложь;
		Элементы.СБВремя2.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВС Тогда
		Элементы.ВСВремя.Доступность = Истина;
		Элементы.ВСВремя2.Доступность = Истина;
	Иначе
		Элементы.ВСВремя.Доступность = Ложь;
		Элементы.ВСВремя2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОбновитьДоступностьВремени();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры


