
&НаКлиенте
Процедура ИспользоватьОповещенияПриИзменении(Элемент)
	
	Если Запись.ИспользоватьОповещения Тогда
		
		Если Запись.ПериодОповещения = 0 Тогда
			Запись.ПериодОповещения = 300; // 5 минут
		КонецЕсли;
		
		Если Запись.ОповещатьОЗадолженности = 0 Тогда
			Запись.ОповещатьОЗадолженности = 2; // 2 дня
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если Запись.ИспользоватьОповещения Тогда		
		Элементы.ОповещатьОЗадолженности.Доступность 	= Истина;
		Элементы.ПериодОпопвещения.Доступность 			= Истина;
	Иначе
		Элементы.ОповещатьОЗадолженности.Доступность 	= Ложь;
		Элементы.ПериодОпопвещения.Доступность 			= Ложь;
	КонецЕсли;
	
КонецПроцедуры