Функция ПолучитьОстаткиЧаcовИСумм(Дата, ФизЛицо) Экспорт
	
	Ст = Новый Структура; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУроки.ЧасыОстаток,
	|	СписанияСуммЗаУроки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.Остатки(&Дата, ) КАК СписанияСуммЗаУроки
	|ГДЕ
	|	СписанияСуммЗаУроки.Клиент = &Клиент"; 	
	Запрос.УстановитьПараметр("Клиент", ФизЛицо);
	Запрос.УстановитьПараметр("Дата", Дата);	
	РезультатЗапроса = Запрос.Выполнить();	
	Остатки = РезультатЗапроса.Выбрать();
	Пока Остатки.Следующий() Цикл
		Ст.Вставить("КоличествоЧасов", '00010101' + Остатки.ЧасыОстаток);
		Ст.Вставить("Сумма", Остатки.СуммаОстаток);		
	КонецЦикла; 
	
	Возврат Ст;
	
КонецФункции

Процедура ПроверкаАбонементов() Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	LM_Абонемент.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.LM_Абонемент КАК LM_Абонемент
	|ГДЕ
	|	LM_Абонемент.Активный";	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Аб из РезультатЗапроса Цикл
		
		Если Аб.Ссылка.Приостановка и НачалоДня(Аб.Ссылка.ДатаВозобновления) <= ТекущаяДата() Тогда
			
			Попытка
				Об = Аб.Ссылка.ПолучитьОбъект();
				Об.Приостановка = Ложь;
				Об.Записать();
			Исключение
				// Ошибка блокировки объекта
			КонецПопытки;
			
		КонецЕсли;		
		
	КонецЦикла;	
	
КонецПроцедуры

