
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли; 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	АвторДокумента = Неопределено;
	Комментарий    = Неопределено;
	
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр УЗ_РасчетыПоЗарплате Приход 		
	Движения.УЗ_РасчетыПоЗарплате.Записывать = Истина;
	Движение = Движения.УЗ_РасчетыПоЗарплате.Добавить();
	Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
	Движение.Период 	 		= КонецДня(ДатаОкончания);
	Движение.Педагог 	 		= Педагог;
	Движение.ЗП					= СуммаДокумента;
	Движение.Организация		= Организация;
	
	// регистр УЗ_РасчетыПоЗарплате Расход 		
	Движения.УЗ_РасчетыПоЗарплате.Записывать = Истина;
	Движение = Движения.УЗ_РасчетыПоЗарплате.Добавить();
	Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
	Движение.Период 	 		= КонецДня(ДатаОкончания);
	Движение.Педагог 	 		= Педагог;
	Движение.ЗП					= СуммаДокумента;
	Движение.Организация		= Организация;
	
КонецПроцедуры
