
Процедура ПередЗаписью(Отказ)

	Если ЗначениеЗаполнено(КодКартыШтрихкод) Тогда
		
		Структ = НайтиПодобныеКарты();
		Если Структ.Количество > 0 Тогда
			Отказ = Истина;
			Сообщить("Карта с таким штрихкодом уже существует у " +Структ.Владелец);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиПодобныеКарты()
	
	С = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДисконтныеКарты.Ссылка КАК Ссылка,
		|	ДисконтныеКарты.Владелец КАК Владелец
		|ИЗ
		|	Справочник.LM_ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	ДисконтныеКарты.Код <> &Код
		|	И ДисконтныеКарты.КодКартыШтрихкод = &КодКартыШтрихкод";	
	Запрос.УстановитьПараметр("Код", Код);  
	Запрос.УстановитьПараметр("КодКартыШтрихкод", КодКартыШтрихкод);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	С.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество());
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		С.Вставить("Владелец",ВыборкаДетальныеЗаписи.Владелец);
	КонецЦикла;	
	
	Возврат С;
	
КонецФункции

