
&НаКлиенте
Процедура ДокументHTMLДокументСформирован(Элемент)
	Если Элемент.Документ.location.host = "accounts.google.com" Тогда
		Если Найти(Элемент.Документ.nameProp, "Success code=") Тогда
			Закрыть(СтрЗаменить(Элемент.Документ.nameProp, "Success code=", ""));
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	//Если Элемент.Документ.location.host = "api.vk.com" Тогда
	//	access_token = "";
	//	Если Получитьaccess_token(Элемент, access_token)  Тогда
	//		Закрыть(access_token);
	//		Возврат;
	//	КонецЕсли; 	
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Функция Получитьaccess_token(Элемент, access_token) Экспорт
		
	access_token = "";
	
	Если Элемент.Документ.location.host = "api.vk.com" Тогда
		hash = Сред(Элемент.Документ.location.hash, 2);
		МассивСтрок = РазложитьСтрокуВМассивПодстрок(hash, "&");
		
		Для каждого Параметр ИЗ МассивСтрок Цикл
			
			Имя = "";
			Значение = "";
			
			Поз = Найти(Параметр, "=");
			Если Поз = 0 Тогда
				Имя = Параметр;
				Значение = "";
			Иначе
				Имя = НРег(СокрЛП(Лев(Параметр,Поз-1)));
				Значение = СокрЛП(Сред(Параметр, Поз+1));
			КонецЕсли;
			
			Если Имя = "access_token" Тогда
				access_token = Значение;
			КонецЕсли;
			
			Если Имя = "user_id" Тогда
				ИдПользователя = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(Стр);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

