
Процедура ОповеститьПоEmail() Экспорт
	
	//Если Признак = "Педагог" Тогда
	//	ФизЛицо = Элементы.Список.ТекущаяСтрока.Педагог;
	//ИначеЕсли Признак = "Ученик" Тогда
	//	ФизЛицо = Элементы.Список.ТекущаяСтрока.Ученик;
	//КонецЕсли;	
	//
	//Если НЕ ЗначениеЗаполнено(ФизЛицо.Email) Тогда
	//	Сообщить("Не заполнен e-mail у " +ФизЛицо+ "!");
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Признак = "Педагог";
	ФизЛицо = Справочники.LM_ФизЛица.НайтиПоКоду("1");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Урок.Ссылка
		|ИЗ
		|	Документ.LM_Урок КАК Урок
		|ГДЕ
		|	Урок.ПометкаУдаления = ЛОЖЬ
		|	И Урок."+Признак+" = &ФизЛицо
		|	И Урок.Дата <= &ДатаОкончания
		|	И Урок.Дата >= &ДатаНачала";     //"+Признак+"
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()+9999999)); //604800Неделя
	РезультатЗапроса = Запрос.Выполнить();	
	Уроки = РезультатЗапроса.Выбрать();
	
	Если Уроки.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли; 
	
	Письмо 				 = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();	
	Письмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	Письмо.Дата 		 = ТекущаяДата();
	//Письмо.Автор 		 = ПользователиКлиентСервер.ТекущийПользователь();
	//Письмо.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Письмо.ОтправительПредставление = Письмо.УчетнаяЗапись.АдресЭлектроннойПочты;
	
	ПолучательПисьма 			   = Письмо.ПолучателиПисьма.Добавить();	
	ПолучательПисьма.Адрес 		   = ФизЛицо.Email;
	Письмо.СписокПолучателейПисьма = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(Письмо.ПолучателиПисьма, Ложь);
	
	Письмо.Тема  = "Напоминание о предстоящих занятиях в рок-школе! Данные сформированы: " +ТекущаяДата();
	Письмо.Текст = "Добрый день, " +ФизЛицо+ "!" + Символы.ПС+ "Напоминаем вам о предстоящих занятиях в нашей рок-школе:" + Символы.ПС+ Символы.ПС;
		
	Пока Уроки.Следующий() Цикл
		
		Урок = Уроки.Ссылка;
		
		Письмо.Текст = Письмо.Текст + Формат(Урок.Дата,"ДФ=дддд")+ " " +Формат(Урок.Дата,"ДЛФ=DDT")+ Символы.ПС;
		
		Если Признак = "Педагог" Тогда		
			Письмо.Текст = Письмо.Текст + "Ученик: " +Урок.Ученик.Фамилия+ " " +Урок.Ученик.Имя + " " +Урок.Ученик.Отчество+ Символы.ПС;
		ИначеЕсли Признак = "Ученик" Тогда
			Письмо.Текст = Письмо.Текст + "Педагог: " +Урок.Педагог.Фамилия+ " " +Урок.Педагог.Имя + " " +Урок.Педагог.Отчество+ Символы.ПС;
		КонецЕсли;	
		
		//Письмо.Текст = Письмо.Текст + "Длительность занятия: " +Формат(Урок.КоличествоЧасов,"ДФ=hh:mm:ss")+ " часов"+ Символы.ПС+
		//"Тариф: " +Урок.Тариф + Символы.ПС+ Символы.ПС;	
	КонецЦикла;
	
	Письмо.ТекстHTML = Письмо.Текст;
	
	Письмо.ДатаОтправления = ТекущаяДата();
	Письмо.Записать(РежимЗаписиДокумента.Запись);      
	ИдентификаторПисьма = Взаимодействия.ВыполнитьОтправкуПисьма(Письмо);
	
КонецПроцедуры
