
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Календарь.ВыделенныеДаты.Очистить();
	Для Каждого Стр из Параметры.СписокДат Цикл
		ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(Стр.Значение);
	КонецЦикла;
	
	ГруппаОбучения = Параметры.ГруппаОбучения;
	ДатаНач = Параметры.ДатаНач;
	ДатаКон = Параметры.ДатаКон;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Оповестить("ЗакрытьФормуВыбораПериода",Элементы.Календарь.ВыделенныеДаты);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбученияПриИзменении(Элемент)
	
	ЗаполнитьДатУроковИзГруппыОбучения();

КонецПроцедуры


Процедура ЗаполнитьДатУроковИзГруппыОбучения()
	
	Если НЕ ЗначениеЗаполнено(ГруппаОбучения) Тогда		
		Возврат;
	КонецЕсли;

	Элементы.Календарь.ВыделенныеДаты.Очистить();
	
	СписокДат = Новый СписокЗначений;
	
	ДатаВыбора = ДатаНач;
	Пока ДатаВыбора <= ДатаКон Цикл
		
		Если ГруппаОбучения.Пн = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Пн" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Вт = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Вт" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Ср = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Ср" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Чт = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Чт" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Пт = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Пт" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Сб = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Сб" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101')); 
			КонецЕсли;
		КонецЕсли;
		Если ГруппаОбучения.Вс = Истина Тогда
			Если Формат(ДатаВыбора,"ДФ=ддд") = "Вс" Тогда
				ЭтаФорма.Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаВыбора+(ГруппаОбучения.Время-'00010101'));
			КонецЕсли;
		КонецЕсли;
		
		ДатаВыбора = ДатаВыбора + (60*60*24); //1 день
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатыИзГруппыОбучения(Команда)
	ЗаполнитьДатУроковИзГруппыОбучения();
КонецПроцедуры
