
Процедура ПриКопировании(ОбъектКопирования)
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	Активный = Неопределено;
	КоличествоЗанятий = Неопределено;
	КоличествоЧасов = Неопределено;
	Комментарий = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ДатаНачала) и ДатаНачала > ДатаОкончания Тогда
		Сообщить("Ошибка! Дата начала больше даты окончания!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Активный Тогда
		
		// Проверка по дате начала
		Для Каждого СтрПриостановка из Приостановки Цикл 			
			Если ДатаНачала > СтрПриостановка.ДатаПриостановки или ДатаОкончания < СтрПриостановка.ДатаВозобновления или СтрПриостановка.ДатаПриостановки >= СтрПриостановка.ДатаВозобновления Тогда
				Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;			
		КонецЦикла;
		
		// Проверка по пересечениям приостановок
		Для Каждого ПроверяемаяПриостановка из Приостановки Цикл 			
			
			Для Каждого СтрПриостановка из Приостановки Цикл 			
				
				Если ПроверяемаяПриостановка.НомерСтроки = СтрПриостановка.НомерСтроки Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПроверяемаяПриостановка.ДатаПриостановки >= СтрПриостановка.ДатаПриостановки и ПроверяемаяПриостановка.ДатаПриостановки < СтрПриостановка.ДатаВозобновления Тогда
					Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
				Если ПроверяемаяПриостановка.ДатаВозобновления >= СтрПриостановка.ДатаПриостановки и ПроверяемаяПриостановка.ДатаВозобновления < СтрПриостановка.ДатаВозобновления Тогда
					Сообщить("Ошибка в датах приостановок! Строка: " +СтрПриостановка.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
	КонецЕсли;             	

КонецПроцедуры
