
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	СуммаДокумента = Расходы.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.LM_Урок") Тогда
		// Заполнение шапки
		ДокументОснования = ДанныеЗаполнения;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.LM_Настройки.ПолучитьПоследнее(ТекущаяДата());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СписанияСуммЗаУроки Расход
	Движения.LM_СписанияСуммЗаУроки.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение = Движения.LM_СписанияСуммЗаУроки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Клиент 			= ТекСтрокаРасходы.Клиент;
		Движение.Педагог 			= ТекСтрокаРасходы.Педагог;
		Движение.Тариф 				= ТекСтрокаРасходы.Тариф;
		Движение.ПредметОбучения 	= ТекСтрокаРасходы.ПредметОбучения;
		Движение.ГруппаОбучения 	= ТекСтрокаРасходы.ГруппаОбучения;
		Движение.Сумма 				= ТекСтрокаРасходы.Сумма;
		Движение.Организация 		= Организация;
		Если ЗначениеЗаполнено(ТекСтрокаРасходы.Часы) Тогда
			Движение.Часы = ТекСтрокаРасходы.Часы*60;
		КонецЕсли;
	КонецЦикла; 
	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.LM_Настройки.ПолучитьПоследнее(ТекущаяДата());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
КонецПроцедуры

