
&НаКлиенте
Процедура ОплатаЗаЗанятиеПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаСЧеловека       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаСЧеловекаПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаЧасПриИзменении(Элемент)
	Объект.ОплатаСЧеловека		 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСОплатыУченикаПриИзменении(Элемент)
	Объект.ОплатаСЧеловека		 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ОплатаЗаЧас			 = 0;
КонецПроцедуры
