
Процедура ОбработкаПроведения(Отказ, Режим)

	//дата запрета проверяется подпиской УЗ_ДатаЗапретаПередЗаписью (модуль УЗ_ДатыЗапрета)
	
	// регистр Касса Расход
	Движения.УЗ_Касса.Записывать = Истина;
	Движение = Движения.УЗ_Касса.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период 	 = Дата;
	Движение.Клиент 	 = ФизЛицо;
	Движение.Сумма 		 = СуммаДокумента;
	Движение.Касса		 = Касса;
	Движение.ВидОперации = ВидОперации;
	Движение.ПредметОбучения = ПредметОбучения;
	Движение.СтатьяЗатрат = СтатьяЗатрат;
	Движение.Организация = Организация;
	
	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики Тогда
		// регистр СписанияСуммЗаУроки 
		Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
		Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Клиент 	 = ФизЛицо;
		Движение.Сумма  	 = СуммаДокумента;
		Движение.ПредметОбучения    = ПредметОбучения;
		Движение.Организация = Организация;
		
		Если ЗначениеЗаполнено(ДокументОснования) Тогда
			//Движение.Педагог = ДокументОснования.Педагог;
			
			СтрокаУченика = ДокументОснования.Ученики.Найти(ФизЛицо,"Ученик");
			Если ЗначениеЗаполнено(СтрокаУченика) Тогда
				Движение.Тариф = СтрокаУченика.Тариф;
				Движение.Часы  = -(-ДокументОснования.КоличествоЧасов * 3600);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса Тогда		
		// регистр УЗ_РасчетыПоЗарплате Расход 		
		Движения.УЗ_РасчетыПоЗарплате.Записывать = Истина;
		Движение = Движения.УЗ_РасчетыПоЗарплате.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 	 		= Дата;
		Движение.Педагог 	 	= ФизЛицо;
		Движение.Сумма				= СуммаДокумента;
		Движение.Организация		= Организация;
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) Тогда
		ЭтотОбъект.АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	АвторДокумента = Неопределено;
	Комментарий    = Неопределено;
	ДокументОснования = Неопределено;
	
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЗ_Урок") Тогда
		//ДокументОснования = ДанныеЗаполнения.Ссылка;
		//ВидОперации		  = Перечисления.УЗ_ВидыОпераций.КассаУченики;
		//Организация 	  = ДанныеЗаполнения.Организация;
		//ПредметОбучения	  = ДанныеЗаполнения.ПредметОбучения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") Тогда
		
		ВидОперации	= Перечисления.УЗ_ВидыОпераций.КассаУченики;
		ФизЛицо	= ДанныеЗаполнения.Ссылка;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры
