
&НаСервере
Функция ПолучитьТЗОстатков(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУроки.Клиент КАК Клиент,
	|	СписанияСуммЗаУроки.ПредметОбучения КАК ПредметОбучения,
	|	СписанияСуммЗаУроки.Регистратор КАК Регистратор,
	|	СписанияСуммЗаУроки.СуммаРасход КАК СуммаРасход,
	|	1 КАК Кол,
	|	СписанияСуммЗаУроки.ЧасыРасход / 60 / 60 КАК ЧасыРасход,
	|	СписанияСуммЗаУроки.ГруппаОбучения КАК ГруппаОбучения,
	|	СписанияСуммЗаУроки.Педагог КАК Педагог
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Регистратор, , ) КАК СписанияСуммЗаУроки
	|ГДЕ
	|	СписанияСуммЗаУроки.Регистратор ССЫЛКА Документ.LM_Урок";
	//|			ИЛИ СписанияСуммЗаУроки.Регистратор ССЫЛКА Документ.ПеремещениеДенег";
	Если НЕ ВключатьБесплатныеУроки Тогда
		Запрос.Текст = Запрос.Текст +Символы.ПС+"И СписанияСуммЗаУроки.СуммаРасход > 0";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

&НаСервере
Функция ПолучитьТЗОстатковТолькоНОВЫХ(ДатаНачала,ДатаОкончания)
	
	//Данные Сгруппированные по "ПредметОбучения - Клиент" (за прошлый период)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУрокиОбороты.ПредметОбучения,
	|	СписанияСуммЗаУрокиОбороты.Клиент
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК СписанияСуммЗаУрокиОбороты
	|ГДЕ
	|	СписанияСуммЗаУрокиОбороты.ЧасыОборот <> 0";	
	Запрос.УстановитьПараметр("НачалоПериода", '20000101');
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаНачала-1);	
	ТЗСтарыеУченики = Запрос.Выполнить().Выгрузить();
	
	
	//Список ПредметовОбучения в выбранном периоде
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУрокиОбороты.ПредметОбучения
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК СписанияСуммЗаУрокиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СписанияСуммЗаУрокиОбороты.ПредметОбучения";	     
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала); 
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ТЗПредметыОбученияВыбПериод = Запрос.Выполнить().Выгрузить();
	
	
	ТЗИтоги = Новый ТаблицаЗначений;
	ТЗИтоги.Колонки.Добавить("Клиент");
	ТЗИтоги.Колонки.Добавить("ПредметОбучения");
	ТЗИтоги.Колонки.Добавить("Регистратор");
	ТЗИтоги.Колонки.Добавить("СуммаРасход");
	ТЗИтоги.Колонки.Добавить("Кол");
	ТЗИтоги.Колонки.Добавить("ЧасыРасход");
	ТЗИтоги.Колонки.Добавить("Педагог");
	ТЗИтоги.Колонки.Добавить("ГруппаОбучения");
	Для Каждого СтрТЗ из ТЗПредметыОбученияВыбПериод Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("ПредметОбучения",СтрТЗ.ПредметОбучения);
		Строки = ТЗСтарыеУченики.НайтиСтроки(Отбор);	
		СтУчПрош = новый массив;
		Для Каждого Ст из Строки Цикл
			СтУчПрош.Добавить(Ст.Клиент);
		КонецЦикла;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУроки.Клиент КАК Клиент,
		|	СписанияСуммЗаУроки.ПредметОбучения КАК ПредметОбучения,
		|	СписанияСуммЗаУроки.Регистратор КАК Регистратор,
		|	СписанияСуммЗаУроки.СуммаРасход КАК СуммаРасход,
		|	1 КАК Кол,
		|	СписанияСуммЗаУроки.ЧасыРасход / 60 / 60 КАК ЧасыРасход,
		|	СписанияСуммЗаУроки.Педагог КАК Педагог,
		|	СписанияСуммЗаУроки.ГруппаОбучения КАК ГруппаОбучения
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Регистратор, , ) КАК СписанияСуммЗаУроки
		|ГДЕ
		|	СписанияСуммЗаУроки.Регистратор ССЫЛКА Документ.LM_Урок
		//|			ИЛИ СписанияСуммЗаУроки.Регистратор ССЫЛКА Документ.ПеремещениеДенег
		|	И НЕ СписанияСуммЗаУроки.Клиент В (&Клиент)
		|	И СписанияСуммЗаУроки.ПредметОбучения = &ПредметОбучения";
		Если НЕ ВключатьБесплатныеУроки Тогда
			Запрос.Текст = Запрос.Текст +Символы.ПС+ "И СписанияСуммЗаУроки.СуммаРасход > 0";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Клиент", СтУчПрош);
		Запрос.УстановитьПараметр("ПредметОбучения", СтрТЗ.ПредметОбучения);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала); 
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
		ВремТЗ = Запрос.Выполнить().Выгрузить();

		
		Для Каждого ВремСтрТЗ Из ВремТЗ Цикл
			//Если ВремСтрТЗ.ПредметОбучения = СтрТЗ.ПредметОбучения Тогда
			Доб = ТЗИтоги.Добавить();
			Доб.Клиент 			= ВремСтрТЗ.Клиент;
			Доб.ПредметОбучения = ВремСтрТЗ.ПредметОбучения;
			Доб.Регистратор		= ВремСтрТЗ.Регистратор;
			Доб.СуммаРасход 	= ВремСтрТЗ.СуммаРасход;
			Доб.Кол 			= ВремСтрТЗ.Кол;
			Доб.ЧасыРасход 		= ВремСтрТЗ.ЧасыРасход;
			Доб.Педагог 		= ВремСтрТЗ.Педагог;
			Доб.ГруппаОбучения	= ВремСтрТЗ.ГруппаОбучения;
			//КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат ТЗИтоги;
	
КонецФункции



&НаСервере
Процедура ПолучитьОстатки()
	
	ТабДок.Очистить();
	ТабДок.ТолькоПросмотр = Ложь;
	
	ОстаткиПрошлогоПериода 	= ПолучитьТЗОстатков('20000101',КонецДня(Период.ДатаНачала-1));
	ОстаткиТекущие 			= ПолучитьТЗОстатковТолькоНОВЫХ(Период.ДатаНачала,КонецДня(Период.ДатаОкончания));
	ОстаткиТекущиеПолные 	= ПолучитьТЗОстатков(Период.ДатаНачала,КонецДня(Период.ДатаОкончания));
	
	КолУчПрош = ОстаткиПрошлогоПериода.Скопировать();
	КолУчПрош.Свернуть("ПредметОбучения,Клиент,Кол");
	КолУчПрош.Свернуть("ПредметОбучения","Кол");
	КолУчПрош.Сортировать("ПредметОбучения");
	
	КолУрПрош = ОстаткиПрошлогоПериода.Скопировать();
	КолУрПрош.Свернуть("ПредметОбучения,Регистратор,Кол");
	КолУрПрош.Свернуть("ПредметОбучения","Кол");
	КолУрПрош.Сортировать("ПредметОбучения");
	
	КолЧасовПрош = ОстаткиПрошлогоПериода.Скопировать();
	КолЧасовПрош.Свернуть("ПредметОбучения","ЧасыРасход");
	КолЧасовПрош.Сортировать("ПредметОбучения");
	
	СуммУрПрош = ОстаткиПрошлогоПериода.Скопировать();
	СуммУрПрош.Свернуть("ПредметОбучения","СуммаРасход");
	СуммУрПрош.Сортировать("ПредметОбучения");
	
	ПКОПрош = ОстаткиПрошлогоПериода.Скопировать(); 
	ПКОПрош.Свернуть("ПредметОбучения");
	ПКОПрош.Колонки.Добавить("ПКОСумма");
	Для Каждого СтрПКОПрош из ПКОПрош Цикл
		 СтрПКОПрош.ПКОСумма = ПолучитьСуммуОплат(СтрПКОПрош.ПредметОбучения,'20000101',КонецДня(Период.ДатаНачала-1),"Прошлый");
	КонецЦикла;
	
	////////////////////////////////////////////////////////
	КолУч = ОстаткиТекущие.Скопировать();
	КолУч.Свернуть("ПредметОбучения,Клиент,Кол");
	КолУч.Свернуть("ПредметОбучения","Кол");
	КолУч.Сортировать("ПредметОбучения");
	
	КолУр = ОстаткиТекущие.Скопировать();
	КолУр.Свернуть("ПредметОбучения,Регистратор,Кол");
	КолУр.Свернуть("ПредметОбучения","Кол");
	КолУр.Сортировать("ПредметОбучения");
	
	КолЧасов = ОстаткиТекущие.Скопировать();
	КолЧасов.Свернуть("ПредметОбучения","ЧасыРасход");
	КолЧасов.Сортировать("ПредметОбучения");
	
	СуммУр = ОстаткиТекущие.Скопировать();
	СуммУр.Свернуть("ПредметОбучения","СуммаРасход");
	СуммУр.Сортировать("ПредметОбучения");
	
	ПКО = ОстаткиТекущие.Скопировать(); 
	ПКО.Свернуть("ПредметОбучения");
	ПКО.Колонки.Добавить("ПКОСумма");
	Для Каждого СтрПКО из ПКО Цикл
		 СтрПКО.ПКОСумма = ПолучитьСуммуОплат(СтрПКО.ПредметОбучения,Период.ДатаНачала,КонецДня(Период.ДатаОкончания),"Текущий");
	КонецЦикла;
	
	////////////////////////////////////////////////////////////
	КолУчПолн = ОстаткиТекущиеПолные.Скопировать();
	КолУчПолн.Свернуть("ПредметОбучения,Клиент,Кол");
	КолУчПолн.Свернуть("ПредметОбучения","Кол");
	КолУчПолн.Сортировать("ПредметОбучения");
	
	КолУрПолн = ОстаткиТекущиеПолные.Скопировать();
	КолУрПолн.Свернуть("ПредметОбучения,Регистратор,Кол");
	КолУрПолн.Свернуть("ПредметОбучения","Кол");
	КолУрПолн.Сортировать("ПредметОбучения");
	
	КолЧасовПолн = ОстаткиТекущиеПолные.Скопировать();
	//КолЧасовПолн.Свернуть("ПредметОбучения,Регистратор,ЧасыРасход");
	КолЧасовПолн.Свернуть("ПредметОбучения","ЧасыРасход");
	КолЧасовПолн.Сортировать("ПредметОбучения");
	
	СуммУрПолн = ОстаткиТекущиеПолные.Скопировать();
	СуммУрПолн.Свернуть("ПредметОбучения","СуммаРасход");
	СуммУрПолн.Сортировать("ПредметОбучения");
	
	ПКОПолн = ОстаткиТекущиеПолные.Скопировать(); 
	ПКОПолн.Свернуть("ПредметОбучения");
	ПКОПолн.Колонки.Добавить("ПКОСумма");
	Для Каждого СтрПКОПолн из ПКОПолн Цикл
		 СтрПКОПолн.ПКОСумма = ПолучитьСуммуОплат(СтрПКОПолн.ПредметОбучения,Период.ДатаНачала,КонецДня(Период.ДатаОкончания),"ТекущийПолный");
	КонецЦикла;

	//////////////////////////////////////////////////////////////////
	ВывестиШапку();
	ВывестиДанныеПрош(КолУчПрош,КолУрПрош,СуммУрПрош,КолЧасовПрош,ПКОПрош);
	ВывестиДанныеТекущ(КолУч,КолУр,СуммУр,КолЧасов,ПКО);
	ВывестиДанныеТекущПолные(КолУчПолн,КолУрПолн,СуммУрПолн,КолЧасовПолн,ПКОПолн);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ПолучитьОстатки();  	
КонецПроцедуры

&НаСервере
Процедура ВывестиШапку()
	
	ТабДок.Область(1,1).ШиринаКолонки = 20;
	ТабДок.Область(1,2).ШиринаКолонки = 15;
	ТабДок.Область(1,3).ШиринаКолонки = 15;
	ТабДок.Область(1,4).ШиринаКолонки = 15;
	ТабДок.Область(1,5).ШиринаКолонки = 15;
	ТабДок.Область(1,6).ШиринаКолонки = 15;
	
	НовыйШрифт = Новый Шрифт (ТабДок.Область(2,1).Шрифт,,12,Истина); // получили такой же шрифт, но жирный
	ТабДок.Область(2,1).Шрифт = НовыйШрифт;
	ТабДок.Область(2,1).Текст = "Аналитика по ученикам";
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПрош(КолУчПрош,КолУрПрош,СуммУрПрош,КолЧасовПрош,ПКОПрош)
	
	ИтогоУч 	= 0;
	ИтогоУр 	= 0;
	ИтогоЧасы 	= 0;
	ИтогоСумма 	= 0;
	ИтогоСуммаПКО 	= 0;
	
	НовыйШрифт = Новый Шрифт (ТабДок.Область(6,1).Шрифт,,,Истина); // получили такой же шрифт, но жирный
	ТабДок.Область(5,1).Шрифт = НовыйШрифт;
	ТабДок.Область(5,2).Шрифт = НовыйШрифт;
	ТабДок.Область(5,3).Шрифт = НовыйШрифт;
	ТабДок.Область(5,4).Шрифт = НовыйШрифт;
	ТабДок.Область(5,5).Шрифт = НовыйШрифт;
	ТабДок.Область(5,6).Шрифт = НовыйШрифт;
	
	ТабДок.Область(5,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(5,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(5,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(5,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(5,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(5,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ТабДок.Область(5,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(5,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(5,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(5,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(5,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(5,6).Обвести(Линия, Линия, Линия, Линия);
	
	//ТабДок.Область(4,1).Шрифт = НовыйШрифт;
	ТабДок.Область(4,1).Текст = "Данные за ПРОШЛЫЙ период по " +Формат((Период.ДатаНачала-1),"ДЛФ=DD")+ " по ВСЕМ ученикам";
	
	ТабДок.Область(5,1).Текст = "Предмет обучения";
	ТабДок.Область(5,2).Текст = "Кол. учеников";
	ТабДок.Область(5,3).Текст = "Кол. уроков";
	ТабДок.Область(5,4).Текст = "Кол. часов";
	ТабДок.Область(5,5).Текст = "Сумма";
	ТабДок.Область(5,6).Текст = "Сумма оплат";
	
	Сч = 5;
	Для Каждого Стр из КолУчПрош Цикл
		
		Сч = Сч + 1;
		
		ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		
		ТабДок.Область(Сч,1).Текст = ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Стр.ПредметОбучения,"<не выбран>");
		ТабДок.Область(Сч,1).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,ПредметОбучения," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		ТабДок.Область(Сч,2).Текст = Стр.Кол;
		ТабДок.Область(Сч,2).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,КоличествоУчеников," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор = Новый Структура();
		Отбор.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки1 = КолУрПрош.НайтиСтроки(Отбор);
		ТабДок.Область(Сч,3).Текст = Строки1[0].Кол;
		ТабДок.Область(Сч,3).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,КоличествоУроков," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки2 = КолЧасовПрош.НайтиСтроки(Отбор1); 
		ТабДок.Область(Сч,4).Текст = Строки2[0].ЧасыРасход;
		ТабДок.Область(Сч,4).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,КоличествоЧасов," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки3 = СуммУрПрош.НайтиСтроки(Отбор2); 
		ТабДок.Область(Сч,5).Текст = Строки3[0].СуммаРасход;
		ТабДок.Область(Сч,5).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,Сумма," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки4 = ПКОПрош.НайтиСтроки(Отбор3); 
		ТабДок.Область(Сч,6).Текст = Строки4[0].ПКОСумма;
		ТабДок.Область(Сч,6).Расшифровка = "ПрошлыйПериод,ПоВсемУченикам,Сумма,ПКО," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");

		ИтогоУч 	= ИтогоУч + Стр.Кол;
		ИтогоУр 	= ИтогоУр + Строки1[0].Кол;
		ИтогоЧасы 	= ИтогоЧасы + Строки2[0].ЧасыРасход;
		ИтогоСумма 	= ИтогоСумма + Строки3[0].СуммаРасход;
		ИтогоСуммаПКО 	= ИтогоСуммаПКО + Строки4[0].ПКОСумма;
		
	КонецЦикла;
	
	Сч = Сч + 1;
	ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,1).Текст = "ИТОГО";
	ТабДок.Область(Сч,1).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,2).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,2).Текст = ИтогоУч;
	ТабДок.Область(Сч,2).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,3).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,3).Текст = ИтогоУр;
	ТабДок.Область(Сч,3).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,4).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,4).Текст = ИтогоЧасы;
	ТабДок.Область(Сч,4).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,5).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,5).Текст = ИтогоСумма;
	ТабДок.Область(Сч,5).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,6).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,6).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,6).Текст = ИтогоСуммаПКО;
	ТабДок.Область(Сч,6).Расшифровка = "ПрошлыйПериод,ОтборПоУченикам,ПредметОбучения,ПКО,ПоВсемПредметамОбучения";
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеТекущ(КолУч,КолУр,СуммУр,КолЧасов,ПКО)
	
	ИтогоУч 	= 0;
	ИтогоУр 	= 0;
	ИтогоЧасы 	= 0;
	ИтогоСумма 	= 0;
	ИтогоСуммаПКО 	= 0;
	
	Сч = Сч + 2;
	
	НовыйШрифт = Новый Шрифт (ТабДок.Область(Сч,1).Шрифт,,,Истина); // получили такой же шрифт, но жирный
	//ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,1).Текст = "Данные с " +Формат(Период.ДатаНачала,"ДЛФ=DD")+ " по " +Формат(Период.ДатаОкончания,"ДЛФ=DD")+ " по НОВЫМ ученикам";
	
	Сч = Сч + 1;
	
	ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,2).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,3).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,4).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,5).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,6).Шрифт = НовыйШрифт;
	
	ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ТабДок.Область(Сч,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,6).Обвести(Линия, Линия, Линия, Линия);
	
	ТабДок.Область(Сч,1).Текст = "Предмет обучения";
	ТабДок.Область(Сч,2).Текст = "Кол. учеников";
	ТабДок.Область(Сч,3).Текст = "Кол. уроков";
	ТабДок.Область(Сч,4).Текст = "Кол. часов";
	ТабДок.Область(Сч,5).Текст = "Сумма";
	ТабДок.Область(Сч,6).Текст = "Сумма оплат";
	
	Для Каждого Стр из КолУч Цикл
		
		Сч = Сч + 1;
		
		ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		
		ТабДок.Область(Сч,1).Текст = ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Стр.ПредметОбучения,"<не выбран>");
		ТабДок.Область(Сч,1).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		ТабДок.Область(Сч,2).Текст = Стр.Кол;
		ТабДок.Область(Сч,2).Расшифровка = "ТекущийПериод,ОтборПоУченикам,КоличествоУчеников," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор = Новый Структура();
		Отбор.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки1 = КолУр.НайтиСтроки(Отбор);
		ТабДок.Область(Сч,3).Текст = Строки1[0].Кол;
		ТабДок.Область(Сч,3).Расшифровка = "ТекущийПериод,ОтборПоУченикам,КоличествоУроков," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки2 = КолЧасов.НайтиСтроки(Отбор1); 
		ТабДок.Область(Сч,4).Текст = Строки2[0].ЧасыРасход;
		ТабДок.Область(Сч,4).Расшифровка = "ТекущийПериод,ОтборПоУченикам,КоличествоЧасов," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки3 = СуммУр.НайтиСтроки(Отбор2); 
		ТабДок.Область(Сч,5).Текст = Строки3[0].СуммаРасход;
		ТабДок.Область(Сч,5).Расшифровка = "ТекущийПериод,ОтборПоУченикам,Сумма," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки4 = ПКО.НайтиСтроки(Отбор3); 
		ТабДок.Область(Сч,6).Текст = Строки4[0].ПКОСумма;
		ТабДок.Область(Сч,6).Расшифровка = "ТекущийПериод,ПоВсемУченикам,Сумма,ПКО," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		ИтогоУч 	= ИтогоУч + Стр.Кол;
		ИтогоУр 	= ИтогоУр + Строки1[0].Кол;
		ИтогоЧасы 	= ИтогоЧасы + Строки2[0].ЧасыРасход;
		ИтогоСумма 	= ИтогоСумма + Строки3[0].СуммаРасход;
		ИтогоСуммаПКО 	= ИтогоСуммаПКО + Строки4[0].ПКОСумма;
		
	КонецЦикла;
	
	Сч = Сч + 1;
	ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,1).Текст = "ИТОГО";
	ТабДок.Область(Сч,1).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,2).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,2).Текст = ИтогоУч;
	ТабДок.Область(Сч,2).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,3).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,3).Текст = ИтогоУр;
	ТабДок.Область(Сч,3).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,4).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,4).Текст = ИтогоЧасы;
	ТабДок.Область(Сч,4).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,5).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,5).Текст = ИтогоСумма;
	ТабДок.Область(Сч,5).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,6).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,6).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,6).Текст = ИтогоСуммаПКО;
	ТабДок.Область(Сч,6).Расшифровка = "ТекущийПериод,ОтборПоУченикам,ПредметОбучения,ПКО,ПоВсемПредметамОбучения";
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеТекущПолные(КолУчПолн,КолУрПолн,СуммУрПолн,КолЧасовПолн,ПКОПолн)
	
	ИтогоУч 	= 0;
	ИтогоУр 	= 0;
	ИтогоЧасы 	= 0;
	ИтогоСумма 	= 0;
	ИтогоСуммаПКО 	= 0;
	
	Сч = Сч + 2;
	
	НовыйШрифт = Новый Шрифт (ТабДок.Область(Сч,1).Шрифт,,,Истина); // получили такой же шрифт, но жирный
	//ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,1).Текст = "Данные с " +Формат(Период.ДатаНачала,"ДЛФ=DD")+ " по " +Формат(Период.ДатаОкончания,"ДЛФ=DD")+" по ВСЕМ ученикам";
	
	Сч = Сч + 1;
	
	ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,2).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,3).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,4).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,5).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,6).Шрифт = НовыйШрифт;
	
	ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ТабДок.Область(Сч,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,6).Обвести(Линия, Линия, Линия, Линия);
	
	ТабДок.Область(Сч,1).Текст = "Предмет обучения";
	ТабДок.Область(Сч,2).Текст = "Кол. учеников";
	ТабДок.Область(Сч,3).Текст = "Кол. уроков";
	ТабДок.Область(Сч,4).Текст = "Кол. часов";
	ТабДок.Область(Сч,5).Текст = "Сумма";
	ТабДок.Область(Сч,6).Текст = "Сумма оплат";
	
	Для Каждого Стр из КолУчПолн Цикл
		
		Сч = Сч + 1;
		
		ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		
		ТабДок.Область(Сч,1).Текст = ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Стр.ПредметОбучения,"<не выбран>");
		ТабДок.Область(Сч,1).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		ТабДок.Область(Сч,2).Текст = Стр.Кол;
		ТабДок.Область(Сч,2).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,КоличествоУчеников," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор = Новый Структура();
		Отбор.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки1 = КолУрПолн.НайтиСтроки(Отбор);
		ТабДок.Область(Сч,3).Текст = Строки1[0].Кол;
		ТабДок.Область(Сч,3).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,КоличествоУроков," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки2 = КолЧасовПолн.НайтиСтроки(Отбор1); 
		ТабДок.Область(Сч,4).Текст = Строки2[0].ЧасыРасход;
		ТабДок.Область(Сч,4).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,КоличествоЧасов," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки3 = СуммУрПолн.НайтиСтроки(Отбор2); 
		ТабДок.Область(Сч,5).Текст = Строки3[0].СуммаРасход;
		ТабДок.Область(Сч,5).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,Сумма," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПредметОбучения",Стр.ПредметОбучения);
		Строки4 = ПКОПолн.НайтиСтроки(Отбор3); 
		ТабДок.Область(Сч,6).Текст = Строки4[0].ПКОСумма;
		ТабДок.Область(Сч,6).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,Сумма,ПКО," +?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
		
		ИтогоУч 	= ИтогоУч + Стр.Кол;
		ИтогоУр 	= ИтогоУр + Строки1[0].Кол;
		ИтогоЧасы 	= ИтогоЧасы + Строки2[0].ЧасыРасход;
		ИтогоСумма 	= ИтогоСумма + Строки3[0].СуммаРасход;
		ИтогоСуммаПКО 	= ИтогоСуммаПКО + Строки4[0].ПКОСумма;
		
	КонецЦикла;
	
	Сч = Сч + 1;
	ТабДок.Область(Сч,1).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,1).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,1).Текст = "ИТОГО";
	ТабДок.Область(Сч,1).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,2).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,2).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,2).Текст = ИтогоУч;
	ТабДок.Область(Сч,2).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,3).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,3).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,3).Текст = ИтогоУр;
	ТабДок.Область(Сч,3).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,4).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,4).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,4).Текст = ИтогоЧасы;
	ТабДок.Область(Сч,4).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,5).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,5).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,5).Текст = ИтогоСумма;
	ТабДок.Область(Сч,5).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПоВсемПредметамОбучения";
	
	ТабДок.Область(Сч,6).Шрифт = НовыйШрифт;
	ТабДок.Область(Сч,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(Сч,6).Обвести(Линия, Линия, Линия, Линия);
	ТабДок.Область(Сч,6).Текст = ИтогоСуммаПКО;
	ТабДок.Область(Сч,6).Расшифровка = "ТекущийПериодПолный,ПоВсемУченикам,ПредметОбучения,ПКО,ПоВсемПредметамОбучения";
	
КонецПроцедуры

&НаСервере
Функция ТабДокОбработкаРасшифровкиНаСервере(Расшифровка)
	
	ИтогоЧасы 	= 0;
	ИтогоСумма 	= 0;
	ИтогоСуммаПКО = 0;
	
	ТабДокРасшифровка = Новый ТабличныйДокумент;
	ТабДокРасшифровка.Защита = Ложь;
	ТабДокРасшифровка.ТолькоПросмотр = Истина;
	ТабДокРасшифровка.ОтображатьСетку = Истина;
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	НовыйШрифт = Новый Шрифт (ТабДок.Область(Сч,1).Шрифт,,,Истина); // получили такой же шрифт, но жирный
	
	Если Найти(Расшифровка,"ПКО") > 0 Тогда
		
		Если Найти(Расшифровка,"ПрошлыйПериод") > 0 Тогда
			
			ПКОПрошлогоПериода 	= ПолучитьПКО('20000101',КонецДня(Период.ДатаНачала-1),"Прошлый");
			
			Сч2 = 0;
			
			ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
			Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
			Иначе
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
			КонецЕсли; 			
			
			ПредмОбуч = ПКОПрошлогоПериода.Скопировать();
			ПредмОбуч.Свернуть("ПредметОбучения,Клиент,ПКО,Касса","СуммаПКО");
			ПредмОбуч.Сортировать("Касса,ПредметОбучения,Клиент,ПКО");
			
			Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
				Строки = ПКОПрошлогоПериода;
			Иначе
				Отбор = Новый Структура();
				Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
				Строки = ПКОПрошлогоПериода.НайтиСтроки(Отбор);
			КонецЕсли;   	
			
			Сч2 = Сч2 + 1;
			//Заголовок
			ТабДокРасшифровка.Область(Сч2,1).Текст = "Касса";
			ТабДокРасшифровка.Область(Сч2,2).Текст = "ПредметОбучения";
			ТабДокРасшифровка.Область(Сч2,3).Текст = "Ученик";
			ТабДокРасшифровка.Область(Сч2,4).Текст = "ПКО";
			ТабДокРасшифровка.Область(Сч2,5).Текст = "СуммаПКО";
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
			ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 40;
			ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
			
			Для Каждого Стр из Строки Цикл
				
				Сч2 = Сч2 + 1;
				//Строки
				ТабДокРасшифровка.Область(Сч2,1).Текст 			= Стр.Касса;
				ТабДокРасшифровка.Область(Сч2,2).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
				ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,4).Расшифровка 	= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.СуммаПКО;
				ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				//ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				
				ИтогоСуммаПКО 	= ИтогоСуммаПКО + Стр.СуммаПКО;
				
			КонецЦикла;
			
			Сч2 = Сч2 + 1;
			//Итоги
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
			
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоСуммаПКО;
			
		ИначеЕсли Найти(Расшифровка,"ТекущийПериодПолный") > 0 Тогда
			
			ПКОТекущегоПериодаПолные 	= ПолучитьПКО(Период.ДатаНачала,Период.ДатаОкончания,"ТекущийПолный");
			
			Сч2 = 0;
			
			ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
			Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
			Иначе
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
			КонецЕсли; 			
			
			ПредмОбуч = ПКОТекущегоПериодаПолные.Скопировать();
			ПредмОбуч.Свернуть("ПредметОбучения,Клиент,ПКО,Касса","СуммаПКО");
			ПредмОбуч.Сортировать("Касса,ПредметОбучения,Клиент,ПКО");
			
			Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
				Строки = ПКОТекущегоПериодаПолные;
			Иначе
				Отбор = Новый Структура();
				Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
				Строки = ПКОТекущегоПериодаПолные.НайтиСтроки(Отбор);
			КонецЕсли;   	
			
			Сч2 = Сч2 + 1;
			//Заголовок
			ТабДокРасшифровка.Область(Сч2,1).Текст = "Касса";
			ТабДокРасшифровка.Область(Сч2,2).Текст = "ПредметОбучения";
			ТабДокРасшифровка.Область(Сч2,3).Текст = "Ученик";
			ТабДокРасшифровка.Область(Сч2,4).Текст = "ПКО";
			ТабДокРасшифровка.Область(Сч2,5).Текст = "СуммаПКО";
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
			ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 40;
			ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
			
			Для Каждого Стр из Строки Цикл
				
				Сч2 = Сч2 + 1;
				//Строки
				ТабДокРасшифровка.Область(Сч2,1).Текст 			= Стр.Касса;
				ТабДокРасшифровка.Область(Сч2,2).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
				ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,4).Расшифровка 	= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.СуммаПКО;
				ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				//ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				
				ИтогоСуммаПКО 	= ИтогоСуммаПКО + Стр.СуммаПКО;
				
			КонецЦикла;
			
			Сч2 = Сч2 + 1;
			//Итоги
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
			
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоСуммаПКО;
			
		Иначе //ТекущийПериодПолный
			
			ПКОТекущегоПериода 	= ПолучитьПКО(Период.ДатаНачала,Период.ДатаОкончания,"Текущий");
			
			Сч2 = 0;
			
			ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
			Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
			Иначе
				ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
			КонецЕсли; 			
			
			ПредмОбуч = ПКОТекущегоПериода.Скопировать();
			ПредмОбуч.Свернуть("ПредметОбучения,Клиент,ПКО,Касса","СуммаПКО");
			ПредмОбуч.Сортировать("Касса,ПредметОбучения,Клиент,ПКО");
			
			Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
				Строки = ПКОТекущегоПериода;
			Иначе
				Отбор = Новый Структура();
				Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
				Строки = ПКОТекущегоПериода.НайтиСтроки(Отбор);
			КонецЕсли;   	
			
			Сч2 = Сч2 + 1;
			//Заголовок
			ТабДокРасшифровка.Область(Сч2,1).Текст = "Касса";
			ТабДокРасшифровка.Область(Сч2,2).Текст = "ПредметОбучения";
			ТабДокРасшифровка.Область(Сч2,3).Текст = "Ученик";
			ТабДокРасшифровка.Область(Сч2,4).Текст = "ПКО";
			ТабДокРасшифровка.Область(Сч2,5).Текст = "СуммаПКО";
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 20;
			ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
			ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 40;
			ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
			
			Для Каждого Стр из Строки Цикл
				
				Сч2 = Сч2 + 1;
				//Строки
				ТабДокРасшифровка.Область(Сч2,1).Текст 			= Стр.Касса;
				ТабДокРасшифровка.Область(Сч2,2).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
				ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Клиент;
				ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,4).Расшифровка 	= Стр.ПКО;
				ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.СуммаПКО;
				ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
				ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				//ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				
				ИтогоСуммаПКО 	= ИтогоСуммаПКО + Стр.СуммаПКО;
				
			КонецЦикла;
			
			Сч2 = Сч2 + 1;
			//Итоги
			ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
			
			ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоСуммаПКО;
			
		КонецЕсли;		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	ИначеЕсли Найти(Расшифровка,"ПрошлыйПериод") > 0 Тогда    //"ПрошлыйПериод,ПоВсемУченикам,ПредметОбучения,"
		
		ОстаткиПрошлогоПериода 	= ПолучитьТЗОстатков('20000101',КонецДня(Период.ДатаНачала-1));
		
		Сч2 = 0;
		
		ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
		Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
		Иначе
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
		КонецЕсли; 			
		
		ПредмОбуч = ОстаткиПрошлогоПериода.Скопировать();
		ПредмОбуч.Свернуть("ПредметОбучения,Клиент,Регистратор,СуммаРасход,ЧасыРасход,Педагог,ГруппаОбучения");
		ПредмОбуч.Сортировать("ПредметОбучения,Клиент,Регистратор");
		
		Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
			Строки = ОстаткиПрошлогоПериода;
		Иначе
			Отбор = Новый Структура();
			Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
			Строки = ОстаткиПрошлогоПериода.НайтиСтроки(Отбор);
		КонецЕсли;   	
		
		Сч2 = Сч2 + 1;
		//Заголовок
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ПредметОбучения";
		ТабДокРасшифровка.Область(Сч2,2).Текст = "Ученик";
		ТабДокРасшифровка.Область(Сч2,3).Текст = "Регистратор";
		ТабДокРасшифровка.Область(Сч2,4).Текст = "Сумма";
		ТабДокРасшифровка.Область(Сч2,5).Текст = "Часы";
		ТабДокРасшифровка.Область(Сч2,6).Текст = "Педагог";
		ТабДокРасшифровка.Область(Сч2,7).Текст = "ГруппаОбучения";
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,6).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,7).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
		ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,6).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,7).ШиринаКолонки = 30;
		
		Для Каждого Стр из Строки Цикл
			
			Сч2 = Сч2 + 1;
			//Строки
			ТабДокРасшифровка.Область(Сч2,1).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
			ТабДокРасшифровка.Область(Сч2,2).Текст 			= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,2).Расшифровка 	= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.СуммаРасход;
			ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.ЧасыРасход;
			ТабДокРасшифровка.Область(Сч2,6).Текст 			= Стр.Педагог;
			ТабДокРасшифровка.Область(Сч2,7).Текст 			= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,7).Расшифровка 	= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			//ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			
			ИтогоЧасы 	= ИтогоЧасы + Стр.ЧасыРасход;
			ИтогоСумма 	= ИтогоСумма + Стр.СуммаРасход;
			
		КонецЦикла;
		
		Сч2 = Сч2 + 1;
		//Итоги
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
		
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоЧасы;
		
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Текст = ИтогоСумма;
		
	ИначеЕсли Найти(Расшифровка,"ТекущийПериод,ОтборПоУченикам") > 0 Тогда   
		
		ОстаткиТекущие = ПолучитьТЗОстатковТолькоНОВЫХ(Период.ДатаНачала,Период.ДатаОкончания);
		
		Сч2 = 0;
		
		ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
		Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
		Иначе
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
		КонецЕсли; 			
		
		ПредмОбуч = ОстаткиТекущие.Скопировать();
		ПредмОбуч.Свернуть("ПредметОбучения,Клиент,Регистратор,СуммаРасход,ЧасыРасход,Педагог,ГруппаОбучения");
		ПредмОбуч.Сортировать("ПредметОбучения,Клиент,Регистратор");
		
		Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
			Строки = ОстаткиТекущие;
		Иначе            			
			Отбор = Новый Структура();
			Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
			Строки = ОстаткиТекущие.НайтиСтроки(Отбор);
		КонецЕсли;
		
		Сч2 = Сч2 + 1;
		//Заголовок
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ПредметОбучения";
		ТабДокРасшифровка.Область(Сч2,2).Текст = "Ученик";
		ТабДокРасшифровка.Область(Сч2,3).Текст = "Регистратор";
		ТабДокРасшифровка.Область(Сч2,4).Текст = "Сумма";
		ТабДокРасшифровка.Область(Сч2,5).Текст = "Часы";
		ТабДокРасшифровка.Область(Сч2,6).Текст = "Педагог";
		ТабДокРасшифровка.Область(Сч2,7).Текст = "ГруппаОбучения";
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,6).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,7).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
		ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,6).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,7).ШиринаКолонки = 30;
		
		Для Каждого Стр из Строки Цикл
			
			Сч2 = Сч2 + 1;
			//Строки
			ТабДокРасшифровка.Область(Сч2,1).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
			ТабДокРасшифровка.Область(Сч2,2).Текст 			= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,2).Расшифровка 	= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.СуммаРасход;
			ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.ЧасыРасход;
			ТабДокРасшифровка.Область(Сч2,6).Текст 			= Стр.Педагог;
			ТабДокРасшифровка.Область(Сч2,7).Текст 			= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,7).Расшифровка 	= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			//ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			
			ИтогоЧасы 	= ИтогоЧасы + Стр.ЧасыРасход;
			ИтогоСумма 	= ИтогоСумма + Стр.СуммаРасход;
			
		КонецЦикла;
		
		Сч2 = Сч2 + 1;
		//Итоги
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
		
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоЧасы;
		
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Текст = ИтогоСумма;
		
	ИначеЕсли Найти(Расшифровка,"ТекущийПериодПолный,ПоВсемУченикам") > 0 Тогда    //"ПрошлыйПериод,ПоВсемУченикам,ПредметОбучения,"
		
		ОстаткиТекущиеПолные = ПолучитьТЗОстатков(Период.ДатаНачала,Период.ДатаОкончания);
		
		Сч2 = 0;
		
		ВыбПредметОбученияСтрокой = Сред(Расшифровка,СтрНайти(Расшифровка,",",НаправлениеПоиска.СКонца)+1);
		Если ВыбПредметОбученияСтрокой <> "<не выбран>" Тогда
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.НайтиПоНаименованию(ВыбПредметОбученияСтрокой);
		Иначе
			ВыбПредметОбучения = Справочники.LM_ПредметыОбучения.ПустаяСсылка();
		КонецЕсли; 			
		
		ПредмОбуч = ОстаткиТекущиеПолные.Скопировать();
		ПредмОбуч.Свернуть("ПредметОбучения,Клиент,Регистратор,СуммаРасход,ЧасыРасход,Педагог,ГруппаОбучения");
		ПредмОбуч.Сортировать("ПредметОбучения,Клиент,Регистратор");
		
		Если Найти(Расшифровка,"ПоВсемПредметамОбучения") > 0 Тогда
			Строки = ОстаткиТекущиеПолные;
		Иначе 
			Отбор = Новый Структура();
			Отбор.Вставить("ПредметОбучения",ВыбПредметОбучения);
			Строки = ОстаткиТекущиеПолные.НайтиСтроки(Отбор);
		КонецЕсли;
		
		Сч2 = Сч2 + 1;
		//Заголовок
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ПредметОбучения";
		ТабДокРасшифровка.Область(Сч2,2).Текст = "Ученик";
		ТабДокРасшифровка.Область(Сч2,3).Текст = "Регистратор";
		ТабДокРасшифровка.Область(Сч2,4).Текст = "Сумма";
		ТабДокРасшифровка.Область(Сч2,5).Текст = "Часы";
		ТабДокРасшифровка.Область(Сч2,6).Текст = "Педагог";
		ТабДокРасшифровка.Область(Сч2,7).Текст = "ГруппаОбучения";
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,2).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,3).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,6).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,7).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДокРасшифровка.Область(Сч2,1).ШиринаКолонки = 20;
		ТабДокРасшифровка.Область(Сч2,2).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,3).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,4).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,5).ШиринаКолонки = 10;
		ТабДокРасшифровка.Область(Сч2,6).ШиринаКолонки = 30;
		ТабДокРасшифровка.Область(Сч2,7).ШиринаКолонки = 30;
		
		Для Каждого Стр из Строки Цикл
			
			Сч2 = Сч2 + 1;
			//Строки
			ТабДокРасшифровка.Область(Сч2,1).Текст 			= ?(ЗначениеЗаполнено(Стр.ПредметОбучения),Строка(Стр.ПредметОбучения),"<не выбран>");
			ТабДокРасшифровка.Область(Сч2,2).Текст 			= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,2).Расшифровка 	= Стр.Клиент;
			ТабДокРасшифровка.Область(Сч2,3).Текст 			= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,3).Расшифровка 	= Стр.Регистратор;
			ТабДокРасшифровка.Область(Сч2,4).Текст 			= Стр.СуммаРасход;
			ТабДокРасшифровка.Область(Сч2,5).Текст 			= Стр.ЧасыРасход;
			ТабДокРасшифровка.Область(Сч2,6).Текст 			= Стр.Педагог;
			ТабДокРасшифровка.Область(Сч2,7).Текст 			= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,7).Расшифровка 	= Стр.ГруппаОбучения;
			ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,2).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,3).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,6).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,7).Обвести(Линия, Линия, Линия, Линия);
			ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			//ТабДокРасшифровка.Область(Сч2,3).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТабДокРасшифровка.Область(Сч2,7).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			
			ИтогоЧасы 	= ИтогоЧасы + Стр.ЧасыРасход;
			ИтогоСумма 	= ИтогоСумма + Стр.СуммаРасход;
			
		КонецЦикла;
		
		Сч2 = Сч2 + 1;
		//Итоги
		ТабДокРасшифровка.Область(Сч2,1).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,1).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,1).Текст = "ИТОГО";
		
		ТабДокРасшифровка.Область(Сч2,5).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,5).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,5).Текст = ИтогоЧасы;
		
		ТабДокРасшифровка.Область(Сч2,4).Шрифт = НовыйШрифт;
		ТабДокРасшифровка.Область(Сч2,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ТабДокРасшифровка.Область(Сч2,4).Обвести(Линия, Линия, Линия, Линия);
		ТабДокРасшифровка.Область(Сч2,4).Текст = ИтогоСумма;
		
	КонецЕсли;	
	
	Возврат ТабДокРасшифровка;	
	
КонецФункции

Функция ПолучитьСуммуОплат(ПредметОбучения, ДатаНачала, ДатаОкончания, Период)
	
	//Данные Сгруппированные по "ПредметОбучения - Клиент" (за прошлый период)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУрокиОбороты.ПредметОбучения,
	|	СписанияСуммЗаУрокиОбороты.Клиент
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК СписанияСуммЗаУрокиОбороты
	|ГДЕ
	|	СписанияСуммЗаУрокиОбороты.ЧасыОборот <> 0";	
	Запрос.УстановитьПараметр("НачалоПериода", '20000101');
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаНачала-1);	
	ТЗСтарыеУченики = Запрос.Выполнить().Выгрузить();

	СтраУч = ТЗСтарыеУченики.Скопировать(,"Клиент");
	//Отбор = Новый Структура();
	//Отбор.Вставить("ПредметОбучения",СтрТЗ.ПредметОбучения);
	//Строки = ТЗСтарыеУченики.НайтиСтроки(Отбор);	
	//СтУчПрош = новый массив;
	//Для Каждого Ст из Строки Цикл
	//	СтУчПрош.Добавить(Ст.Клиент);
	//КонецЦикла;  	
	
	Если НЕ ЗначениеЗаполнено(Кассы) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПКО.СуммаДокумента) КАК Сумма
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПКО
		|ГДЕ
		|	ПКО.Проведен = ИСТИНА
		|	И ПКО.Дата >= &ДатаНачала
		|	И ПКО.Дата <= &ДатаОкончания
		|	И ПКО.ПредметОбучения = &ПредметОбучения";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПКО.СуммаДокумента) КАК Сумма
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПКО
		|ГДЕ
		|	ПКО.Проведен = ИСТИНА
		|	И ПКО.ПредметОбучения = &ПредметОбучения
		|	И ПКО.Дата >= &ДатаНачала
		|	И ПКО.Дата <= &ДатаОкончания
		|	И ПКО.Касса В(&Кассы)"; 	
		Запрос.УстановитьПараметр("Кассы", Кассы);	
	КонецЕсли;
	
	Если Период = "Текущий" Тогда
		Запрос.Текст =  Запрос.Текст +Символы.ПС+	"И НЕ ПКО.LM_ФизЛицо В(&Клиенты)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Клиенты", СтраУч);
	Запрос.УстановитьПараметр("ПредметОбучения", ПредметОбучения);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Сумма = NULL Тогда
			Возврат 0;
		Иначе
			Возврат ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьПКО(ДатаНачала,ДатаОкончания,Период)
	
	//Данные Сгруппированные по "ПредметОбучения - Клиент" (за прошлый период)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУрокиОбороты.ПредметОбучения,
	|	СписанияСуммЗаУрокиОбороты.Клиент
	|ИЗ
	|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК СписанияСуммЗаУрокиОбороты
	|ГДЕ
	|	СписанияСуммЗаУрокиОбороты.ЧасыОборот <> 0";	
	Запрос.УстановитьПараметр("НачалоПериода", '20000101');
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаНачала-1);	
	ТЗСтарыеУченики = Запрос.Выполнить().Выгрузить();
	СтраУч = ТЗСтарыеУченики.Скопировать(,"Клиент");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПКО.Ссылка КАК ПКО,
	|	ПКО.Клиент КАК Клиент,
	|	ПКО.Касса,
	|	ПКО.Сумма КАК СуммаПКО,
	|	ПКО.ПредметОбучения КАК ПредметОбучения
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПКО
	|ГДЕ
	|	ПКО.Проведен = ИСТИНА
	|	И ПКО.Дата >= &ДатаНачала
	|	И ПКО.Дата <= &ДатаОкончания";
	
	Если Период = "Текущий" Тогда
		Запрос.Текст =  Запрос.Текст +Символы.ПС+	"И НЕ ПКО.Клиент В(&Клиенты)";
	КонецЕсли;
	Если ЗначениеЗаполнено(Кассы) Тогда
		Запрос.Текст =  Запрос.Текст +Символы.ПС+	"И ПКО.Касса В(&Кассы)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Кассы", Кассы);
	Запрос.УстановитьПараметр("Клиенты", СтраУч);	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Сортировать("ПредметОбучения,Клиент,ПКО");
	
	Возврат РезультатЗапроса;
	
КонецФункции


&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТабДокРасшифровка = ТабДокОбработкаРасшифровкиНаСервере(Расшифровка);
	ТабДокРасшифровка.Показать("Расшифровка по " +Расшифровка);	
	
КонецПроцедуры


