
&НаСервере
Процедура ОбновитьСтатьиЗатратНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПКО.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ПКО КАК ПКО
	//	|ГДЕ
	//	|	ПКО.Проведен = ИСТИНА
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	РКО.Ссылка
	//	|ИЗ
	//	|	Документ.РКО КАК РКО
	//	|ГДЕ
	//	|	РКО.Проведен = ИСТИНА";
	//
	//РезультатЗапроса = Запрос.Выполнить();	
	//КассовыеДокументы = РезультатЗапроса.Выбрать();	
	//Пока КассовыеДокументы.Следующий() Цикл
	//	
	//	Если ТипЗнч(КассовыеДокументы.ПриходникСсылка.) Тогда
	//		
	//	КонецЕсли;
	//	
	//	Если ТипЗнч(КассовыеДокументы.РасходникСсылка) Тогда
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатьиЗатрат(Команда)
	ОбновитьСтатьиЗатратНаСервере();
КонецПроцедуры
