
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента",ДанныеС ,ЭтаФорма, , , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УЗ_Общий.ЕстьОрганизации() Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
