
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ Данные.Ссылка.ЭтоГруппа и Данные.Ссылка.Сумма > 0 Тогда
		Если Данные.Ссылка.КоличествоЧасов > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Данные.Ссылка.Наименование+ " (" +Формат(Данные.Ссылка.Сумма/Данные.Ссылка.КоличествоЧасов,"ЧДЦ=2")+ " за 1 час)";				
		ИначеЕсли Данные.Ссылка.КоличествоУроков > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Данные.Ссылка.Наименование+ " (" +Формат(Данные.Ссылка.Сумма/Данные.Ссылка.КоличествоУроков,"ЧДЦ=2")+ " за 1 урок)";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
